[
  {
    "filename": "00-SSW-540-Syllabus_2024F.json",
    "course_code": "SSW 540",
    "course_title": "Fundamentals of Software Engineering",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Fundamentals of Software Engineering (SSW 540)\n    Semester: Fall 2024\n    Credits: 3\n    Instructor: Dr. Y. Morgan\n    Description: This course introduces the subject of software engineering from a quantitative, analytic- and metrics-based point of view.\n    Learning Outcomes: Understanding the consequential issues when the proper software engineering methods are ignored. Understand the impact of requirements and architecture planning on software development. Able to evaluate newer methods and practices in software engineering.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "2022 MGT 695 A Syllabus - Leading Creat Collab - Ancowitz v1.json",
    "course_code": "MGT 695 A",
    "course_title": "Leading Creative Collaboration",
    "semester": "Fall",
    "year": "2022",
    "text": "Course: Leading Creative Collaboration (MGT 695 A)\n    Semester: Fall 2022\n    Credits: \n    Instructor: Nancy Ancowitz\n    Description: This course builds individual awareness of creativity and collaboration skills while increasing your capacity for both.\n    Learning Outcomes: Communicate the value of enhancing a group’s or organization's creative and collaborative skills and mentor others to build and use these skills at work Design and facilitate effective group ideation and problem-solving events Confidently engage others in productive creative abrasion to make the best use of the diversity of perspectives on a team Motivate yourself and others to address problems that have long been tolerated or accepted as unsolvable attributes of the status quo Assess key attributes of an organization's culture so you can influence the architectural, interpersonal, and philosophical systems that undermine innovation Set personal standards and priorities for yourself as leaders committed to exceptional group creativity and collaboration, and monitor your own continued practice and growth Lead others to address meaningful problems and possibilities everywhere you find them\n    Prerequisites: MGT 612",
    "embedding_dim": 1536
  },
  {
    "filename": "2023F CM 605-WS.json",
    "course_code": "",
    "course_title": "",
    "semester": "",
    "year": "",
    "text": "Course:  ()\n    Semester:  \n    Credits: \n    Instructor: Joseph M. Schwed, CSP, SSM, CS, CSFSM, FMA, RPA\n    Description: A study of safety practices in the construction industry.\n    Learning Outcomes: Discuss occupational safety and health management systems Assess risk at a construction site using a variety of tools Understand construction site operations as it pertains to safety management\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "2023F_CS556_WS_Syllabus.json",
    "course_code": "CS 556",
    "course_title": "Mathematical Foundations of Machine Learning",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Mathematical Foundations of Machine Learning (CS 556)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Prof. Erisa Terolli\n    Description: This course will give a rigorous introduction to the mathematical foundations of machine learning, including but not limited to frequently used tools in linear algebra, calculus, probability, and widely applied methods such as linear regression and support vector machines.\n    Learning Outcomes: apply basic concepts in linear algebra to problems in machine learning apply principal component analysis to analyze high-dimensional data apply gradient descent to solve general optimization problems apply linear regression to solve real-world problems use numpy to solve machine learning problems such as recommender systems\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "2023S CS 560-A.json",
    "course_code": "CS560",
    "course_title": "Statistical Machine Learning",
    "semester": "",
    "year": "",
    "text": "Course: Statistical Machine Learning (CS560)\n    Semester:  \n    Credits: \n    Instructor: Jie Shen\n    Description: This course aims to explore the theoretical foundations of machine learning algorithms. Each topic will be fairly independent.\n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "2024 WS  SPRING MGT-609-WS Syllabus.json",
    "course_code": "MGT609-WS",
    "course_title": "Project Management Fundamentals",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Project Management Fundamentals (MGT609-WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Dr. Alan C. Maltz, P.E.\n    Description: The purpose of this course is to introduce students to the world of projects and to projects’ real-life struggles and challenges.\n    Learning Outcomes: Understand the basic principles of managing projects using PMBOK® standards. Create a project charter Develop a work breakdown structure Create a project schedule Understand Earned Value concepts Develop a comprehensive project plan\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "2024-05-13 ME514WS CourseSyllabus.json",
    "course_code": "ME514WS/MT514WS",
    "course_title": "Sustainable Energy",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Sustainable Energy (ME514WS/MT514WS)\n    Semester: Summer 2024\n    Credits: \n    Instructor: H. Hadim\n    Description: Topics in this course include current and potential future energy systems, fuel resources, conversion of resources, and end-use, with emphasis on meeting local and global energy needs in the 21st century in a sustainable manner.\n    Learning Outcomes: Students will be able to assess the performance and basic design of various energy conversion systems including traditional (combustion and nuclear) and alternative (solar, wind, hydrogen, etc.) approaches. Students will become familiar with environmental issues related to the greenhouse effect and global climate change. Students will perform comparative analysis of various energy conversion systems. The main criteria used for comparison include economic, social acceptability and environmental consequences.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "2024-Fall-MIS 710-Syllabus.json",
    "course_code": "MIS 710",
    "course_title": "Process Innovation and Management",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Process Innovation and Management (MIS 710)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Ting Yi (Danny) Ho\n    Description: The focus of this course is on business transformation and the role of information technology (IT) as both an enabler and a driver of change.\n    Learning Outcomes: Describe the relationship between business process and organizational strategy Map business processes with process modeling languages Conduct process assessment from different management perspectives Identify improvement opportunities for business processes Redesign business processes by applying process improvement principles Evaluate BPM maturity\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "2024F BIA 686 Syllabus 08-22-24 v2 .json",
    "course_code": "BIA-686",
    "course_title": "Applied Analytics Practicum",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Applied Analytics Practicum (BIA-686)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Patricia Saporito\n    Description: Business intelligence and analytics is key to enabling successful competition in today’s world of 'big data'. This course focuses on helping students to not only understand how best to leverage business intelligence and analytics to become more effective decision makers.\n    Learning Outcomes: Analyze the impact of BI&A on the organization Understand how best to apply BI&A methods and techniques in addressing strategic business problems Understand the role of BI&A in helping organizations make better decisions Conduct an in-depth analysis of a strategic business problem Communicate the results of an in-depth analysis to both a technical and management audience\n    Prerequisites: Students should complete at least 5 courses in the BI&A curriculum before taking this course.",
    "embedding_dim": 1536
  },
  {
    "filename": "2024S-CPE593-WS.json",
    "course_code": "CPE593",
    "course_title": "Applied Data Structures and Algorithms",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Applied Data Structures and Algorithms (CPE593)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Jingxuan Liu\n    Description: Applied Data Structures and algorithms is an intensive introduction to brilliant solutions to classical problems with wide application across computer programming.\n    Learning Outcomes: Analyze programs and algorithms and determine the complexity of the code. Identify the best possible performance based on limits to algorithmic efficiency. Write, debug, and test data structures. Apply the best data structure or algorithm for a particular purpose. Recognize and apply common approaches to high-performance such as divide-and-conquer. Independently research new algorithms based on knowledge of the fundamentals. Gain familiarity with other areas of computer algorithms for future growth and learning.\n    Prerequisites: CPE552 EE553 or equivalent knowledge of Java, C++, or Python",
    "embedding_dim": 1536
  },
  {
    "filename": "2c MGT 612 Web Zoom _Syl__ 2024 Summer ws.json",
    "course_code": "MGT 612",
    "course_title": "Leader Development",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Leader Development (MGT 612)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Dr. Zvi Aronson\n    Description: This course explores the human side of project management, focusing on interpersonal competencies and skills required for leading and motivating groups/teams.\n    Learning Outcomes: Introduce and describe key skills and competencies associated with leading others in a project management environment. Provide opportunities to learn about your own strengths and development needs associated with these skills. Familiarize with key theories and principles relating to the study of leadership and the human side of project management.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "AAI_CPE_EE 551 Course Syllabus; Section WS and WS2; Spring 2023; v2.json",
    "course_code": "AAI/CPE/EE 551",
    "course_title": "Engineering Programming: Python",
    "semester": "Spring",
    "year": "2023",
    "text": "Course: Engineering Programming: Python (AAI/CPE/EE 551)\n    Semester: Spring 2023\n    Credits: \n    Instructor: Dr. Kevin Ryan\n    Description: This course presents tools, techniques, algorithms, and programming techniques using the Python programming language for data intensive applications and decision making.\n    Learning Outcomes: learn how to design and program python applications. learn how to use lists, tuples, and dictionaries in python programs. learn how to write loops and decision statements in python. learn how to read and write files in python. extract and analyze data in python. learn how to use indexing and slicing to access data in python programs. prepare for their future career in Technology related fields.\n    Prerequisites: Basic knowledge of programming",
    "embedding_dim": 1536
  },
  {
    "filename": "AAI_CPE_EE 551 Course Syllabus_ Sections WS and WS1_ Spring 2024.json",
    "course_code": "AAI/CPE/EE 551",
    "course_title": "Engineering Programming: Python",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Engineering Programming: Python (AAI/CPE/EE 551)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Dr. Kevin Ryan\n    Description: This course presents tools, techniques, algorithms, and programming techniques using the Python programming language for data intensive applications and decision making.\n    Learning Outcomes: learn how to design and program python applications. learn how to use lists, tuples, and dictionaries in python programs. learn how to write loops and decision statements in python. learn how to read and write files in python. extract and analyze data in python. learn how to use indexing and slicing to access data in python programs. prepare for their future career in technology related fields.\n    Prerequisites: Basic knowledge of programming",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 500 Syllabus Yan.json",
    "course_code": "BIA 500",
    "course_title": "Business Analytics: Data, Models and Decisions",
    "semester": "Summer",
    "year": "2023",
    "text": "Course: Business Analytics: Data, Models and Decisions (BIA 500)\n    Semester: Summer 2023\n    Credits: 3\n    Instructor: Bei Yan\n    Description: This course explores data-driven methods that are used to analyze and solve complex business problems.\n    Learning Outcomes: Utilize the appropriate data-centric software tools and techniques. Develop and apply data-driven methods to analyze and solve complex business problems. Interpret the output of tools and techniques and run simulation sensitivity analyses to improve business decisions. Assess opportunities for creating value using data-driven decision-making. Develop actionable business decisions through combined methodologies and developed systems.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 610 SYLLABUS Spring 2023-1.json",
    "course_code": "BIA 610",
    "course_title": "Applied Analytics",
    "semester": "Spring",
    "year": "2023",
    "text": "Course: Applied Analytics (BIA 610)\n    Semester: Spring 2023\n    Credits: \n    Instructor: Victor Moya\n    Description: Applied Analytics is intended to reinforce the understanding of analysis as a way to build models that can focus attention on parts of the system that can be improved through intervention.\n    Learning Outcomes: Recount a set of appropriate analysis techniques when presented with a business problem Understand how particular techniques might be used to make sense of data Analyze a situation and traces of past behavior to recommend future actions Apply analytic and machine learning techniques to business problems Compare the results of different analytic techniques Synthesize analysis performed at different levels into a policy recommendation\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 610 Syllabus.json",
    "course_code": "BIA 610",
    "course_title": "Applied Analytics",
    "semester": "",
    "year": "",
    "text": "Course: Applied Analytics (BIA 610)\n    Semester:  \n    Credits: 3\n    Instructor: Elizabeth Gomez\n    Description: This course is intended to integrate all previously taken courses in the program by presenting a set of increasingly complex business problems.\n    Learning Outcomes: Cultivate a fundamental understanding of the descriptive, predictive, prescriptive and artificial intelligence techniques Combine descriptive, prescriptive prescriptive and artificial intelligence methodologies using software tools Create useful insights from structured and unstructured datasets of any size Compare the performance of different descriptive, predictive, prescriptive and artificial intelligence techniques Design business analytics projects focused on obtaining actionable insights from complex data Integrate the decisions using the insights into a policy recommendation Combine knowledge and skills to continue learning\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 650 Syllabus.json",
    "course_code": "BIA 650",
    "course_title": "Optimization and Process Analytics",
    "semester": "",
    "year": "",
    "text": "Course: Optimization and Process Analytics (BIA 650)\n    Semester:  \n    Credits: \n    Instructor: Alkis Vazacopoulos\n    Description: This course covers basic concepts in optimization and heuristic search with an emphasis on process improvement and optimization.\n    Learning Outcomes: Develop and solve optimization models in a number of domains such as supply chain modeling, marketing, production, asset management, capital budgeting, and financial portfolio analysis. Analyze optimization models arising in data analysis. Develop simulation models and design simulation experiments. Perform process mining on workflow logs. Comprehend optimization models that arise in machine learning and deploy appropriate optimization methods.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 652 Syllabus.json",
    "course_code": "BIA 652",
    "course_title": "Multivariate Data Analytics",
    "semester": "",
    "year": "",
    "text": "Course: Multivariate Data Analytics (BIA 652)\n    Semester:  \n    Credits: \n    Instructor: Dr. Feng Mai\n    Description: This course focuses on understanding the basic methods underlying multivariate analysis through computer applications using R.\n    Learning Outcomes: Understand the probabilistic perspective of multivariate data analytics to interpret the uncertainty in inference. Apply the essential techniques for analyzing multivariate data. Use the programming language R to analyze multivariate data.\n    Prerequisites: Calculus (e.g., derivative and integration) Linear Algebra (e.g., vector and matrix operation)",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 660 Syllabus.json",
    "course_code": "BIA660",
    "course_title": "Web Mining",
    "semester": "",
    "year": "",
    "text": "Course: Web Mining (BIA660)\n    Semester:  \n    Credits: 3\n    Instructor: Jordan Low\n    Description: In this course, students will learn through hands-on experience how to extract data from the web and analyze web-scale data using distributed computing.\n    Learning Outcomes: Identify and profile candidate sources of valuable data Automatically collect and manage the information needed for analytics tasks Apply a wide range of both quantitative and qualitative analytics techniques to applications across multiple business domains\n    Prerequisites: Some programming experience Multivariate Data Analytics (BIA 652) Data & Knowledge Management (MIS 630) Knowledge Discovery in Databases (MIS 637)",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 668 syllabus0.5.json",
    "course_code": "BIA 668",
    "course_title": "Management of A.I. Technologies",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Management of A.I. Technologies (BIA 668)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Jordan W. Suchow\n    Description: This course surveys applications of artificial intelligence to business and technology in the digital era.\n    Learning Outcomes: Manage the performance of an AI system and monitor its ongoing effectiveness Distinguish between hype and rapid advances in AI methods. Assess AI systems along dimensions of fairness, accountability, transparency, ethics, and the law. Manage AI/ML projects. Develop strategy for deployment of AI solutions within an organization.\n    Prerequisites: One advanced ML course (e.g., BIA 667 Deep Learning)",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 668 Syllabus_Summer 23.json",
    "course_code": "BIA 668",
    "course_title": "Management of AI Technologies",
    "semester": "Summer",
    "year": "2023",
    "text": "Course: Management of AI Technologies (BIA 668)\n    Semester: Summer 2023\n    Credits: \n    Instructor: Jordan W. Suchow\n    Description: Artificial Intelligence (AI) is an interdisciplinary field that draws on insights from computer science, engineering, mathematics, statistics, linguistics, psychology, and neuroscience to design agents that can perceive the environment and act upon it.\n    Learning Outcomes: Manage the performance of an AI system and monitor its ongoing effectiveness Distinguish between hype and rapid advances in AI methods Assess AI systems along dimensions of fairness, accountability, transparency, ethics, and the law Plan the lifecycle of an AI project, from discovery through post-deployment monitoring Develop strategy for deployment of AI solutions within an organization\n    Prerequisites: One advanced ML course (e.g., BIA 667 Deep Learning)",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 672 Syllabus_Summer 23.json",
    "course_code": "BIA672",
    "course_title": "BIA672 Marketing Analytics",
    "semester": "Summer",
    "year": "2023",
    "text": "Course: BIA672 Marketing Analytics (BIA672)\n    Semester: Summer 2023\n    Credits: \n    Instructor: Mr. Khasha Dehnad\n    Description: This course is designed to help students understand consumer/customer behavior using marketing models, analytics and data management techniques.\n    Learning Outcomes: Use a variety of SAS tools to store and manage data and perform analysis Source various types of government data and incorporate it into marketing analysis. Develop marketing models to illustrate consumer behavior Use marketing models to analyze consumer behavior to shape marketing strategies Develop predictive models to forecast consumer behavior\n    Prerequisites: Admission requirements for the BI&A program.",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 674 Course Syllabus (1).json",
    "course_code": "BIA-674",
    "course_title": "Supply Chain Analytics",
    "semester": "",
    "year": "",
    "text": "Course: Supply Chain Analytics (BIA-674)\n    Semester:  \n    Credits: 3\n    Instructor: Dr. Alkis Vazacopoulos\n    Description: Supply Chain Management introduces the tactical and strategic issues surrounding the design and operation of supply chains, to develop supply chain analytical skills for solving real-life problems.\n    Learning Outcomes: Assess the goals for the supply chain to interpret the impact of supply chain decisions on the success of a global company. Determine the major drivers of supply chain performance and calculate key metrics that track the performance of the supply chain. Develop analytic methodologies to extract knowledge and business intelligence from the dynamic information about future demand, available production capacity, and sources of supply. Develop models and utilize optimization methods for facility location, network design decisions, transportation optimization, aggregate planning, inventory optimization using Excel Solver and Decision Analysis tools. Construct actionable business decisions using retail sales data, value product availability, and make pricing and inventory decisions. Assess opportunities using procurement and vendor data, perform spend analysis and make sourcing decisions. Assess risk in the supply chain and develop methodologies to reduce risk by using simulation and scenario-based modeling.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA 678 Syllabus.json",
    "course_code": "BIA 678",
    "course_title": "BIA 678 Big Data Technologies",
    "semester": "",
    "year": "",
    "text": "Course: BIA 678 Big Data Technologies (BIA 678)\n    Semester:  \n    Credits: 3\n    Instructor: Dr. Alkis Vazacopoulos\n    Description: The field of Big Data is emerging as one of the transformative business processes of recent times. It utilizes classic techniques from Business Intelligence & Analysis, along with new tools and processes to deal with the volume, velocity, and variety associated with big data.\n    Learning Outcomes: Determine the characteristics of Big Data and their dimensions of scalability Assess opportunities for Big Data to construct a strategy and show its value to the enterprise Develop a Data Governance methodology to assess the risk of data strategies Construct actionable business decisions by combining Big Data with Business Intelligence, Data Science, Machine Learning, and Artificial Intelligence (AI) technologies Develop models by combining Big Data with text mining association rules and recommenders systems Assess opportunities for developing Big Data technologies using Sparc and other similar technologies Assess risk in the enterprise and the society by the ethical issues of AI and Big Data technologies Assess the speed of development of internet of things, robotic applications when combined with Big Data technologies\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA-686 Syllabus.json",
    "course_code": "BIA686",
    "course_title": "Applied Analytics Practicum",
    "semester": "",
    "year": "",
    "text": "Course: Applied Analytics Practicum (BIA686)\n    Semester:  \n    Credits: \n    Instructor: Christopher Asakiewicz, PhD.\n    Description: Business intelligence and analytics is key to enabling successful competition in today’s world of 'big data'. This course focuses on helping students to not only understand how best to leverage business intelligence and analytics to become more effective decision makers.\n    Learning Outcomes: Analyze the impact of BI&A on the organization Apply BI&A methods and techniques in addressing strategic business problems Leverage business intelligence and analytics to help organizations make better evidence-based decisions Conduct an in-depth analysis of a strategic business problem Communicate the results of an in-depth analysis to both a technical and management audience\n    Prerequisites: MIS636 BIA500 BIA650 BIA652 BIA658",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA500 600_Syllabus_2024Fall.json",
    "course_code": "BIA 500 WS",
    "course_title": "Business Analytics: Data, Models, and Decisions",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Business Analytics: Data, Models, and Decisions (BIA 500 WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Bei Yan\n    Description: This course introduces fundamental concepts, techniques, and tools of data analysis for business management and decision-making.\n    Learning Outcomes: Understand concepts and roles of data analysis in business applications Acquire techniques for describing, analyzing and interpreting data for business decision making Learn how to apply software for data analysis, including Excel, Tableau and RapidMiner\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA650-Prastacos-Course outline-Fall 2024.json",
    "course_code": "BIA 650",
    "course_title": "Optimization and Process Analytics",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Optimization and Process Analytics (BIA 650)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Gregory Prastacos\n    Description: Decision-Making is one of the most important functions of Management. This course emphasizes understanding and formulating complex problems, developing decision models, and using them for effective decision making.\n    Learning Outcomes: Follow a systematic and proven methodology for addressing complex problems Select the appropriate optimization model and technique to apply in each case Develop and solve optimization models in various domains Use popular software packages for decision making Analyze optimization models arising in data analysis Analyze alternative scenarios and examine sensitivity of key strategy parameters Develop simulation models and design simulation experiments\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA652_Syllabus_Fall2024WS.json",
    "course_code": "BIA-652",
    "course_title": "Multivariate Data Analytics",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Multivariate Data Analytics (BIA-652)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dr. Somayeh Moazeni\n    Description: This course introduces basic theory and methods underlying multivariate analytics. Students will study techniques used for regression, classification, dimension reduction, and clustering.\n    Learning Outcomes: understand the probability behind basic statistical models use Python to analyze multivariate data think critically about data and research findings\n    Prerequisites: Calculus (e.g., derivative and integration) Linear Algebra (e.g., vector and matrix operation)",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA656_syllabus.json",
    "course_code": "BIA656",
    "course_title": "Advanced Data Analytics and Machine Learning",
    "semester": "Fall",
    "year": "2022",
    "text": "Course: Advanced Data Analytics and Machine Learning (BIA656)\n    Semester: Fall 2022\n    Credits: \n    Instructor: Germán Creamer\n    Description: The significant amount of corporate information available requires a systematic and analytical approach to select the most important information and anticipate major events.\n    Learning Outcomes: Understand the foundations of statistical learning algorithms Apply statistical models and analytical methods to several business domains using a statistical language. Recognize the value and also the limits of statistical learning algorithms to solve business problems. Written and oral communications skills: students are required to communicate properly during the class discussions. Solve a major analytical problem using large datasets in a project and communicate its results in a professional way.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA658_Syllabus_2024F.json",
    "course_code": "BIA 658-WS",
    "course_title": "Social Network Analytics and Visualization",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Social Network Analytics and Visualization (BIA 658-WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Bei Yan\n    Description: This course introduces concepts, theories, and tools of social network analysis (SNA). Application areas include social media analytics, information and technology diffusion and market segmentation and targeting.\n    Learning Outcomes: Understand concepts and theories of social networks Learn how to collect and analyze social networks data Acquire analytical skills to conduct social network analysis\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "BIA672WS Marketing Analytics Syllabus Fall2024.json",
    "course_code": "BIA 672-WS",
    "course_title": "Marketing Analytics",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Marketing Analytics (BIA 672-WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dr. Jie Xu\n    Description: The effectiveness of marketing decisions highly depends on the information obtained through marketing analytics.\n    Learning Outcomes: Understand and apply advanced marketing analytics techniques and how to use and interpret the information it provides to make relevant business recommendations. Evaluate different research designs and understand when to apply each in different business situations. Improve their ability to work in teams and communicate their findings in presentations and written reports.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CM 510 Syllabus_ 2023S CM 510-WS.json",
    "course_code": "CM 510",
    "course_title": "Construction Fundamentals",
    "semester": "Summer",
    "year": "2019",
    "text": "Course: Construction Fundamentals (CM 510)\n    Semester: Summer 2019\n    Credits: \n    Instructor: Professor Dia Hunter\n    Description: This course introduces the student to the construction industry, built environment history, development and current theories.\n    Learning Outcomes: Articulate significant challenges involved in the construction industry. Elucidate the leading edges and explore the current limits of construction management theory, knowledge and practice. Articulate how construction management practice has developed over time. Calculate a construction cost estimate and simple construction schedule.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CM 581 Stevens Temp Structures Syllabus 2024 Fall.json",
    "course_code": "CM-581",
    "course_title": "Temporary Structures for Heavy Construction",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Temporary Structures for Heavy Construction (CM-581)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Paula J. Loomis, PhD, FAIA, FSAME, AICP, LEED AP, SAP\n    Description: Temporary structures, in construction, are those that are erected and used to aid in the construction of permanent structures. They are used in constructing buildings, bridges, tunnels and various other structures. This course explains how to design, operate, manage, cost, and oversee the safety of temporary structures. It also covers legal and insurance aspects.\n    Learning Outcomes: Demonstrate how to manage the design, erection, use and de-construction of a temporary structure utilizing advanced cost, time, quality and safety controls. Analyze potential safety risks associated with temporary structures and how to mediate those risks in traditional and risky climates. Understand the contractual arrangements for temporary structures and associated cost and risk implications. Exhibit consistent use of integrative thinking.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CM-529-WS-Fall-2024 Syllabus.json",
    "course_code": "CM-529-WS",
    "course_title": "Construction Project Scheduling",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Construction Project Scheduling (CM-529-WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dr. Mohammad Ilbeigi\n    Description: This course provides an overview of construction project scheduling concepts and computer applications employed in construction including scheduling logic, critical path method, resources management, progress monitoring, and probabilistic scheduling methods.\n    Learning Outcomes: Explain basic scheduling theory and scheduling specifications Assemble the Work Breakdown Structure (WBS) Calculate schedule float and determine the critical path Apply resource loading and leveling to schedules Schedule work activities based on applied logic Construct and finalize the baseline project schedule Perform Earned Value Management (EVM) Describe forensic scheduling for construction claims Utilize construction schedules for project management Create Construction Project Schedules Understand the Construction Project Control Process Implement project schedule using MS Project\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CM.CE 541-Information & Syllabus. Spring 2024.json",
    "course_code": "CM/CE 541-WS & WS1",
    "course_title": "Project Management in Construction Engineering",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Project Management in Construction Engineering (CM/CE 541-WS & WS1)\n    Semester: Spring 2024\n    Credits: \n    Instructor: K. Y. Billah\n    Description: \n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Course Syllabus_ 2022F FE 620-A_WS.json",
    "course_code": "FE 620 A/WS",
    "course_title": "Pricing and Hedging",
    "semester": "Fall",
    "year": "2022",
    "text": "Course: Pricing and Hedging (FE 620 A/WS)\n    Semester: Fall 2022\n    Credits: \n    Instructor: Dan Pirjol\n    Description: The course will give an introduction to the financial markets for equity, FX, interest rates, commodities and credit, and their derivatives.\n    Learning Outcomes: Be familiar with the main concepts of the fixed income markets: interest rates, yield curves, currency exchange rates, and with the main derivative contracts linked to these markets. Understand the risk-neutral approach to pricing derivatives, and be able to apply it to pricing forward contracts, futures and options. Be familiar with European and American options and their Greeks. Understand how to hedge the main risks of a financial derivative and of a portfolio of derivatives.\n    Prerequisites: Basic concepts of probability and statistics Calculus Knowledge of a programming language (R or Excel are preferred)",
    "embedding_dim": 1536
  },
  {
    "filename": "Course Syllabus_ 2024A FE 520-WS.json",
    "course_code": "FE 520",
    "course_title": "Financial Lab: Introduction to Python for Financial Applications",
    "semester": "SUMMER",
    "year": "2024",
    "text": "Course: Financial Lab: Introduction to Python for Financial Applications (FE 520)\n    Semester: SUMMER 2024\n    Credits: \n    Instructor: Zhi Chen\n    Description: This course is designed for those students have no experience or limited experience on Python. This course will cover the basic syntax rules, modules, importing packages (numpy, pandas), data visualization, and Intro for machine learning on Python.\n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Course Syllabus_ 2024A ME 635-WS.json",
    "course_code": "ME 635-WS",
    "course_title": "Modeling and Simulation",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Modeling and Simulation (ME 635-WS)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Sayed Aziz\n    Description: Modeling and simulation is a dynamic field that is utilized in a wide range of physical and social sciences, engineering fields, health, business, education, and many other disciplines.\n    Learning Outcomes: Build mathematical and logical modeling of physical systems and processes Differentiate between static, dynamic and stochastic models; Apply appropriate approximations for physical problems Simulate a variety of problems relevant to engineers\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Course Syllabus_ 2024S FIN 629-WS.json",
    "course_code": "FIN 629 WS",
    "course_title": "Fixed Income Securities",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Fixed Income Securities (FIN 629 WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Shobhit S Thapar\n    Description: This course covers introduction and understanding of various Fixed Income Securities, their valuation, measurement and management of associated risk.\n    Learning Outcomes: Understanding Fixed Income Securities Markets Valuation of Fixed Income Bonds Risk Management of Fixed Income Securities Understanding, measuring and mitigating Bond Convexity Understanding the term Structure of Interest Rates, Yield Curve Construction and analyzing interest rate risk Understanding of Credit Spreads and analyzing credit spread risk Introduction to Securitized Products with detailed review of Mortgage Backed Securities Understanding of foreign exchange spot rates and forward rates to calculate Covered Interest Parity Understand interest rate futures, forwards, and options and their payoffs Determine alternate methods of enhancing 'investors’ wealth' in fixed income markets\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CPE 517-WS Syllabus (Spring 2024).json",
    "course_code": "CPE/EE 517-WS",
    "course_title": "Digital & Computer Systems Architecture",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Digital & Computer Systems Architecture (CPE/EE 517-WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Md Abu Sayeed\n    Description: This course introduces students to computer architecture and the design of efficient computing and memory systems.\n    Learning Outcomes: Understand the quantitative approach for computer architecture design and be able to apply metrics to evaluate performance of a computer system. Comprehend the fundamentals of digital systems and organization of an ARM processor. Understand the basic Instruction Set Architecture (ISA) and able to design a five-stage pipeline. Analyze computer memory systems using cache protocols, paging mechanism, and memory access time formula. Able to use instruction, thread and data level parallelisms.\n    Prerequisites: C/C++ Assembly Programming",
    "embedding_dim": 1536
  },
  {
    "filename": "CPE 679WS Syllabus Spring 2024.json",
    "course_code": "CPE 679WS",
    "course_title": "Computer and Information Networks",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Computer and Information Networks (CPE 679WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Prof. Min Song\n    Description: Learn the technologies that make the Internet work, focusing on the OSI and TCP/IP models.\n    Learning Outcomes: Demonstrate a good understanding of network performance analysis. Demonstrate the ability to research and communicate in presenting high-level network topics. Demonstrate an overall understanding of issues in network architectures.\n    Prerequisites: C/C++/MATLAB programming",
    "embedding_dim": 1536
  },
  {
    "filename": "CPE 690Spring2024 Syllabus.json",
    "course_code": "",
    "course_title": "Introduction to VLSI Design",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Introduction to VLSI Design ()\n    Semester: Spring 2024\n    Credits: \n    Instructor: Professor Zhuo Feng\n    Description: This course provides introductions to various design aspects of modern integrated circuits, as well as related modeling and analysis techniques.\n    Learning Outcomes: Be able to develop transistor level circuit diagrams for CMOS digital gates, storage components and arithmetic operators and be able to estimate their performance. Understand the operation of the MOS transistor and its application to CMOS digital design and understand the tradeoffs between performance, noise margin and power dissipation. Know how to layout full custom CMOS circuits obeying process design rules and evaluate the function and performance of these circuits using commercially available circuit simulation tools (SPICE). Understand the CMOS fabrication process and the relationship between layout and mask based fabrication. Know how to design transistor-level digital circuits using a number of different circuit techniques including static compound, pseudo-NMOS and dynamic gates and understand the tradeoffs in performance, area and power dissipation.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CPE 695 Syllabus.json",
    "course_code": "CPE 695",
    "course_title": "Applied Machine Learning",
    "semester": "",
    "year": "",
    "text": "Course: Applied Machine Learning (CPE 695)\n    Semester:  \n    Credits: 3\n    Instructor: Shucheng Yu\n    Description: An introductory course for machine learning theory, algorithms, and applications.\n    Learning Outcomes: Demonstrate basic principles and algorithms of representative machine learning systems including supervised learning, unsupervised learning, batch learning, online learning, model-based learning, and instance-based learning. Determine appropriate machine learning algorithms for real-world tasks. Evaluate the performance of a machine learning system with appropriate performance measurement metrics. Apply appropriate training, evaluation, and parameter tuning techniques to improve machine learning algorithms. Develop a machine learning system with programming languages such as Python. Create interactive documentation with program codes and rich texts. Write a comprehensive report to communicate the main ideas, techniques, and findings of a machine learning project.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CPE521-WS-Fall2024.json",
    "course_code": "CPE 521-WS",
    "course_title": "Autonomous Mobile Robotic Systems",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Autonomous Mobile Robotic Systems (CPE 521-WS)\n    Semester: Fall 2024\n    Credits: 3\n    Instructor: Yi Guo\n    Description: This course will offer the students an overview of the technology of autonomous mobile robotic systems and the mechanisms that allow a mobile robot to move through a real-world environment to perform its tasks.\n    Learning Outcomes: Student will be able to express the kinematic model of a differential drive mobile robot. Student will be able to express the relationship between the global reference frame of the plane and the local reference frame of the robot. Student will be able to identify common sensors on robots and describe the functionality. Student will be able to understand robot localization methods and apply them in indoor environments.\n    Prerequisites: Working knowledge of calculus Discrete math Matrix algebra Probability Ability to program in Matlab, C++, or Python",
    "embedding_dim": 1536
  },
  {
    "filename": "CPE646_syllabus_Sum24.json",
    "course_code": "CpE 646",
    "course_title": "Pattern Recognition and Classification",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Pattern Recognition and Classification (CpE 646)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Hong Man\n    Description: Introduction and general pattern recognition concerns, statistical pattern recognition, supervised learning, unsupervised learning, syntactic pattern recognition, neural pattern recognition.\n    Learning Outcomes: Apply mathematical principles such as linear algebra, probabilities and statistics. Understand the components in common pattern recognition systems and the stages in system design cycle. Analyze a practical pattern recognition problem, provide an effective system solution, and assess the expected system performance. Implement pattern recognition system or component using computer language (e.g. C/C++, python) or software (e.g. Matlab).\n    Prerequisites: Probability and statistics (EE 605 or equivalent)",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 501 Introduction to Java.json",
    "course_code": "CS 501",
    "course_title": "Introduction to Java Programming",
    "semester": "",
    "year": "",
    "text": "Course: Introduction to Java Programming (CS 501)\n    Semester:  \n    Credits: 3\n    Instructor: Debbie Reid\n    Description: This course introduces the Java programming language to students with little programming experience.\n    Learning Outcomes: Apply programming techniques including decision and loop structures, arrays, sorts, string handling, and subprograms to create and execute Java programs. Apply object-oriented programming principles including classes, test classes, objects, methods, and exception handling in multiple files. Develop graphical user interfaces and components. Create a project using advanced JAVA features.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 520 Syllabus.json",
    "course_code": "CS 520",
    "course_title": "Introduction to Operating Systems",
    "semester": "",
    "year": "",
    "text": "Course: Introduction to Operating Systems (CS 520)\n    Semester:  \n    Credits: 3\n    Instructor: Debbie Reid\n    Description: This course will provide focus on the use and internals of modern operating systems. Primary topics include the process concept; concurrency and how to program with threads; memory management techniques, including virtual memory and shared libraries; file system data structures; and input/output (I/O).\n    Learning Outcomes: Integrate the concepts and creation of computer processes, threads and multi-tasking. Elucidate memory management and virtual memory concepts in modern OS processes. Explicate concurrency and synchronization processes. Incorporate the scheduling policies of modern operating systems to prevent deadlocks. Compare the concepts of data input/output systems, mass storage and file system management. Analyze how operating systems must incorporate security and protection.\n    Prerequisites: CS 550 CS 570 CS 590",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 525-WN Syllabus.json",
    "course_code": "CS 525-WN",
    "course_title": "Systems Programming",
    "semester": "",
    "year": "",
    "text": "Course: Systems Programming (CS 525-WN)\n    Semester:  \n    Credits: 3\n    Instructor: Debbie Reid\n    Description: In this course, students will learn to develop system-level software in the C programming language while gaining an understanding of the UNIX family of operating systems and their programming environment.\n    Learning Outcomes: Create efficient C programs on the Linux platform. Allocate and free memory correctly and safely. Execute Linux commands and processes via command line, scripts or GUI-based applications. Recognize and execute process, signal, and socket system calls. Develop and utilize applications through streams, buffers, pipes, files, and devices. Link standard, shared, and generated libraries to applications.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 541 Course schedule.json",
    "course_code": "",
    "course_title": "",
    "semester": "",
    "year": "",
    "text": "Course:  ()\n    Semester:  \n    Credits: \n    Instructor: \n    Description: \n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 545 Syllabus.json",
    "course_code": "CS 545",
    "course_title": "Human Computer Interaction",
    "semester": "",
    "year": "",
    "text": "Course: Human Computer Interaction (CS 545)\n    Semester:  \n    Credits: \n    Instructor: Debbie Reid\n    Description: This is an introduction to Human Computer Interaction (HCI). It covers basic concepts, principles, and frameworks in HCI; models of interaction; and design guidelines and methodologies.\n    Learning Outcomes: Design a human computer interaction that considers cognition, emotion, and social mechanisms. Design a human computer interaction that considers how human computer interactions can affect people’s attitudes and behaviors. Collect and interpret stakeholder needs to identify project requirements. Implement a user-centered approach to design an interface for a given application or activity. Apply predictive techniques to conduct analytical evaluation and usability testing of a user interface. Communicate usability testing findings to stakeholders.\n    Prerequisites: Undergraduates: CS 182 or CS 385 Graduates: CS 590",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 546 Syllabus.json",
    "course_code": "CS 546",
    "course_title": "Web Programming",
    "semester": "",
    "year": "",
    "text": "Course: Web Programming (CS 546)\n    Semester:  \n    Credits: \n    Instructor: Frank Appolonia\n    Description: This course will provide students with a first strong approach of internet programming.\n    Learning Outcomes: Install and configure a modern web programming environment that includes a web server, a modern backend programming language, and a modern database. Write programs in the chosen programming language that use most of the features of the language and its standard libraries. Use a modern database in order to create database-driven applications. Create HTML pages and use basic JavaScript code to enhance the pages. Evaluate the accessibility level of web pages and create web pages designed to work for all people, regardless of their hardware, culture, location, physical or mental ability. Use client-side techniques (such as AJAX) and frameworks that allow for the creation of dynamic web pages. Identify major vulnerabilities in web development and use defensive tactics to reduce their likelihood. Create a complete market-ready database-driven web application in a team that goes through the entire software life cycle, with technical and non-technical presentations.\n    Prerequisites: CS-442 or CS-561 CS-146 or SOC-611",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 549 Distributed Systems and Cloud Computing - Summer 22 - Syllabus.json",
    "course_code": "CS 549",
    "course_title": "Distributed Systems and Cloud Computing",
    "semester": "Summer",
    "year": "2022",
    "text": "Course: Distributed Systems and Cloud Computing (CS 549)\n    Semester: Summer 2022\n    Credits: 3\n    Instructor: Dominic Duggan\n    Description: The objective of this course is to give students a basic grounding in designing and implementing distributed and cloud systems.\n    Learning Outcomes: Develop distributed and Web services, using programming paradigms such as client-server, streaming, peer-to-peer, event-driven, and REST. Explain protocols for achieving agreement in distributed systems, such as Two Phase Commit (2PC) and Paxos, and explain their application in scenarios such as transactional e-commerce and cloud infrastructure. Explain methods for building highly available services, and explain the trade-off between weak and strong consistency as given in the CAP theorem. Develop cloud applications using frameworks such as Cassandra, Hadoop, Pig, and Hive. Describe implementation methods and protocols for distributed storage systems: distributed file systems, distributed hash tables, cloud storage, and NoSQL databases.\n    Prerequisites: You are expected to have a certain amount of programming maturity, since you will be developing distributed programs during the course of the term. You should know Java since that will be the language for the assignments.",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 550 Syllabus.json",
    "course_code": "CS 550",
    "course_title": "Computer Organization and Programming",
    "semester": "",
    "year": "",
    "text": "Course: Computer Organization and Programming (CS 550)\n    Semester:  \n    Credits: \n    Instructor: Reza Peyrovian\n    Description: This course provides an intensive introduction to material on computer organization and assembly language programming required for entrance into the graduate program in Computer Science or Computer Engineering.\n    Learning Outcomes: Understand how a computer program written in high-level language, such as C, along with its data can be translated into binary machine language and stored as binary numbers, leading to the concept of stored-program computer. Understand how other forms of data, such as decimal or real numbers, are represented, and how hardware follows arithmetic algorithms (such as add and multiply) to perform these operations. Understand the internal structure of the CPU to accomplish load, store, arithmetic, and branching using program counter, registers, and various memory addressing modes. Understand the difference between pipelined and un-pipelined CPUs, their data paths and control paths, and measuring CPU performance. Understand the fundamentals of memory hierarchy and the role of caches in speeding instruction execution and measuring and improving performance of caches. Write programs in assembly language involving loops, branching, and subroutine; compile and execute them.\n    Prerequisites: Undergraduates need permission from their advisor.",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 555 Syllabus-2.json",
    "course_code": "CS 555",
    "course_title": "Agile Methods for Software Development",
    "semester": "",
    "year": "",
    "text": "Course: Agile Methods for Software Development (CS 555)\n    Semester:  \n    Credits: \n    Instructor: Dr. Richard Ens\n    Description: This course examines agile methods, including Extreme Programming (XP), Scrum, Lean, Crystal, Dynamic Systems Development Method and Feature-Driven Development to understand how rapid realization of software occurs most effectively.\n    Learning Outcomes: Compare and contrast several agile methods for software development. Compare and contrast the origins and motivations of the Agile Manifesto vs. historical methodologies. Refactor code and tests to meet changing needs. Develop and monitor project backlogs. Measure and monitor velocity of development. Compare and contrast plan-driven versus agile methods.\n    Prerequisites: Programming experience in an object-oriented language, preferably Java or Python",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 555 Syllabus.json",
    "course_code": "CS 555",
    "course_title": "Agile Methods for Software Development",
    "semester": "",
    "year": "",
    "text": "Course: Agile Methods for Software Development (CS 555)\n    Semester:  \n    Credits: \n    Instructor: Dr. Richard Ens\n    Description: This course examines agile methods, including Extreme Programming (XP), Scrum, Lean, Crystal, Dynamic Systems Development Method and Feature-Driven Development to understand how rapid realization of software occurs most effectively.\n    Learning Outcomes: Compare and contrast several agile methods for software development. Compare and contrast the origins and motivations of the Agile Manifesto vs. historical methodologies. Refactor code and tests to meet changing needs. Develop and monitor project backlogs. Measure and monitor velocity of development. Compare and contrast plan-driven versus agile methods.\n    Prerequisites: Programming experience in an object-oriented language, preferably Java or Python",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 561 Syllabus.json",
    "course_code": "CS 561",
    "course_title": "Database Management Systems I",
    "semester": "",
    "year": "",
    "text": "Course: Database Management Systems I (CS 561)\n    Semester:  \n    Credits: \n    Instructor: Samuel Kim\n    Description: In this course, students will become acquainted with the fundamental concepts of database management systems during class.\n    Learning Outcomes: Summarize the purpose of database systems Represent and manipulate objects in database systems Compare and contrast different types of data models and the associated languages, including E-R model, relational model and relational database model Apply the basic design process and the purpose of E-R model Apply the relational model and its language, relational algebra Apply the relational database model and its language, SQL Build databases using design process and normalization\n    Prerequisites: CS590 (Introduction to Data Structures and Algorithms) or the equivalent",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 570 Syllabus-1.json",
    "course_code": "CS 570",
    "course_title": "Data Structures",
    "semester": "",
    "year": "",
    "text": "Course: Data Structures (CS 570)\n    Semester:  \n    Credits: 3\n    Instructor: Reza Peyrovian\n    Description: This course introduces the most commonly used data structures, as well as sorting algorithms, using the Java programming language.\n    Learning Outcomes: Understand the notion of Abstract Data Types, and their use in object-oriented designs. Calculate the Big O of diverse non-recursive algorithms and use it to compare efficiency. Use and understand Collection class in Java, with major emphasis on Lists, Stacks and Queues. Implement double linked lists in Java. Implement Binary Search Trees, Max/Min-Heaps, Priority Queues in Java, and understand the basic concepts of self-balancing Binary Search Trees. Understand Sets and Maps, and more specifically implement hash tables in Java. Understand, and implement recursive algorithms, and data structures. Combine different classes together to implement big programming assignments in Java that combine some of the data structures studied in class.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 583 Syllabus.json",
    "course_code": "CS 583",
    "course_title": "Deep Learning",
    "semester": "",
    "year": "",
    "text": "Course: Deep Learning (CS 583)\n    Semester:  \n    Credits: 3\n    Instructor: Justo Karell\n    Description: Deep learning (DL) is a family of the most powerful and popular machine learning (ML) methods and has wide real-world applications including face recognition, machine translation, self-driving cars, recommender systems, and the Go game.\n    Learning Outcomes: Formulate real-world problems as machine learning models. Write Python programs to implement linear models, CNNs, RNNs, autoencoders, and GANs. Analyze the performance of deep learning and improve accuracy. Implement advanced techniques for improving deep learning. Implement parallel computing using learning libraries.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 584 Syllabus.json",
    "course_code": "CS 584",
    "course_title": "Natural Language Processing",
    "semester": "",
    "year": "",
    "text": "Course: Natural Language Processing (CS 584)\n    Semester:  \n    Credits: \n    Instructor: Justo Karell\n    Description: Natural language processing (NLP) is one of the most important technologies referring to automatic computational processing of human languages.\n    Learning Outcomes: Implement gradient descent (GD) and stochastic gradient descent (SGD) techniques for learning problems Apply word2vec models in real-world text corpora for business applications Implement neural network models and backpropagation optimization in platforms such as TensorFlow Apply dependency parsing, recurrent neural networks, and convolutional neural networks in NLP Apply sequence to sequence models and attention in NLP deep neural networks\n    Prerequisites: Undergraduate: MA 222 or MA 232 Graduate: permission of instructor",
    "embedding_dim": 1536
  },
  {
    "filename": "CS 590-WN Syllabus.json",
    "course_code": "CS 590",
    "course_title": "Algorithms",
    "semester": "",
    "year": "",
    "text": "Course: Algorithms (CS 590)\n    Semester:  \n    Credits: \n    Instructor: Reza Peyrovian\n    Description: This course will provide focus on more complex data structures, and algorithm design and analysis, using one or more modern imperative language(s).\n    Learning Outcomes: Differentiate the meaning of big-O, Theta, and Omega notations. Apply the Master Theorem to prove asymptotic assumptions. Compare and analyze basic and advanced sorting algorithms. Implement search trees such as Binary Search Trees, AVL trees, and Red-Black Trees. Implement standard algorithms using graphs and weighted graphs in C++/Java (e.g., DFS, BFS, MST, topological sort). Implement standard algorithms to solve the shortest path finding problem (Dijkstra, Bellman-Ford, Floyd-Warshall). Apply standard algorithm design techniques such as the greedy technique, dynamic programming, hashing, and space/time trade-offs.\n    Prerequisites: CS 501 CS 570",
    "embedding_dim": 1536
  },
  {
    "filename": "CS-546 Syllabus F24.json",
    "course_code": "CS-546",
    "course_title": "Web Programming",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Web Programming (CS-546)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Patrick Hill\n    Description: This course will provide students with a first strong approach of internet programming.\n    Learning Outcomes: Install and configure a web programming environment. Write programs in the chosen programming language. Use a modern database to create database-driven applications. Create HTML pages and use basic JavaScript. Evaluate web accessibility. Use client-side techniques and frameworks. Identify major vulnerabilities in web development. Create a complete market-ready database-driven web application.\n    Prerequisites: Graduate: CPE 590/ CS 590 – Algorithms Undergraduate: CS 182 - Introduction to Comp Sci-Honors II or CS 385 - Algorithms",
    "embedding_dim": 1536
  },
  {
    "filename": "CS522WN Syllabus Fall 2024.json",
    "course_code": "CS 522",
    "course_title": "Mobile Systems and Applications",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Mobile Systems and Applications (CS 522)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dominic Duggan\n    Description: Personal computing is now mobile and cloud-based. Disconnected mobile computing challenges many of the assumptions underlying much of today's distributed systems.\n    Learning Outcomes: Implement and run applications on a mobile computing platform. Explain algorithms and strategies for data management and power management. Describe wireless communication protocols, including cell phone and LAN protocols, and network protocols for mobile applications. Describe threats and countermeasures for securing mobile devices. Explain the use of context scenarios and personas in user experience (UX) engineering for mobile applications. Apply design patterns and software architectures to manage the complexity of mobile applications, including cloud-based apps.\n    Prerequisites: CS 385 (Undergraduate) CS 590 (Graduate) Programming Maturity and Experience with Java or C#",
    "embedding_dim": 1536
  },
  {
    "filename": "cs559ws_fall24_wk00_Orientation.json",
    "course_code": "CS 559",
    "course_title": "Machine Learning: Fundamentals and Applications",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Machine Learning: Fundamentals and Applications (CS 559)\n    Semester: Fall 2024\n    Credits: \n    Instructor: In Suk Jang\n    Description: \n    Learning Outcomes: Be more proficient in math and programming. Be able to implement general ML techniques for a variety of problem types. Be able to recognize when and how a new problem can be solved with an existing technique.\n    Prerequisites: MA 222 Probability Theory Programming - Python Linear Algebra Probability and Optimization",
    "embedding_dim": 1536
  },
  {
    "filename": "cs559_fall24_syllabus.json",
    "course_code": "CS 559 WS",
    "course_title": "Machine Learning: Fundamentals and Applications",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Machine Learning: Fundamentals and Applications (CS 559 WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: In Suk Jang, Ph.D\n    Description: In this course, we will talk about the foundational principles that drive machine learning applications and practice implementing machine learning algorithms.\n    Learning Outcomes: Explain Bayesian decision theory, the likelihood ratio, and minimum risk classification. Implement Maximum Likelihood Estimation for Logistic Regression. Apply dimensionality reduction using Principal Component Analysis. Implement classifiers using linear discriminant functions and Fisher’s Linear Discriminant Analysis. Implement k-nearest neighbors and perform non-parametric classification. Implement k-means clustering and perform EM for Gaussian mixtures. Explain the advantages of Support Vector Machines and margin maximization. Explain boosting and decision tree models. Implement backpropagation for basic neural networks and understand the concepts of deep neural networks.\n    Prerequisites: Math 222: Probability Theory",
    "embedding_dim": 1536
  },
  {
    "filename": "DA ML-Lec1-MIS 637 WS Fall 24 Syllabus-Outcome.json",
    "course_code": "MIS 637 WS",
    "course_title": "Data Analytics and Machine Learning",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Data Analytics and Machine Learning (MIS 637 WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Mahmoud Daneshmand, PhD\n    Description: This course will focus on Data Analytics and Machine Learning Algorithms as well as their applications in solving real world Scientific, Business and Operation problems.\n    Learning Outcomes: Recognize, define, describe, and clearly state the objectives of Knowledge Discovery using Data Analytics and Machine Learning algorithms. Identify relevant data and corresponding Databases, data Warehouses, and data sources from which Knowledge can be extracted. Specify how to access the relevant data. Preprocess the data (Clean, Integrate, and Transform). Determine proper algorithm(s) and discovery model(s) & technologies. Decide on up-to-date software packages to execute specified algorithms/ techniques. Executive & and Discover: patterns, dependencies that will enable predictions; extract Nuggets of knowledge; make intelligent Scientific, business, and operation decisions. Present and document results. Input the extracted knowledge to the next iterative steps. Demonstrate that your skilled as being a Data Scientist capable of executing an end to end Data Analytics and Machine Learning Project.\n    Prerequisites: Student is expected to be familiar with calculus, elementary probability & statistics.",
    "embedding_dim": 1536
  },
  {
    "filename": "EE 548 syllabus (4).json",
    "course_code": "EE/CpE548",
    "course_title": "Digital Signal Processing",
    "semester": "",
    "year": "",
    "text": "Course: Digital Signal Processing (EE/CpE548)\n    Semester:  \n    Credits: \n    Instructor: Hongbin Li\n    Description: \n    Learning Outcomes: \n    Prerequisites: An undergraduate-level course on Linear System Theory, or Signals and Systems, or equivalent",
    "embedding_dim": 1536
  },
  {
    "filename": "EE 548 syllabus.json",
    "course_code": "EE/CpE 548",
    "course_title": "Digital Signal Processing",
    "semester": "",
    "year": "",
    "text": "Course: Digital Signal Processing (EE/CpE 548)\n    Semester:  \n    Credits: \n    Instructor: Hongbin Li\n    Description: Review of mathematics of signals and systems including sampling theorem, Fourier transform, z-transform, Hilbert transform; algorithms for fast computation: DFT, DCT computation, convolution; filter design techniques: FIR and IIR filter design, time and frequency domain methods, window method and other approximation theory based methods; structures for realization of discrete time systems: direct form, parallel form, lattice structure and other state-space canonical forms (e.g., orthogonal filters and related structures); roundoff and quantization effects in digital filters: analysis of sensitivity to coefficient quantization, limit cycle in IIR filters, scaling to prevent overflow, role of special structures.\n    Learning Outcomes: Apply mathematical knowledge including Fourier transform and z-transform to solve digital signal processing problems. Use convolution, filtering, sampling and other related engineering principles to analyze digital signals and digital systems. Apply filter design techniques to design digital finite-duration impulse response (FIR) and infinite-duration impulse response (IIR) filters. Use DSP software (e.g., Matalb) to simulate digital signals and systems, perform filtering, and design digital filters.\n    Prerequisites: An undergraduate-level course on Linear System Theory, or Signals and Systems, or equivalent",
    "embedding_dim": 1536
  },
  {
    "filename": "EE 583 syllabus.json",
    "course_code": "EE/NIS-583",
    "course_title": "Wireless Communications",
    "semester": "",
    "year": "",
    "text": "Course: Wireless Communications (EE/NIS-583)\n    Semester:  \n    Credits: \n    Instructor: \n    Description: This course will cover fundamental concepts in mobile wireless systems such as propagation and fading, modulation and coding, cellular systems, channel estimation and equalization, power control, handoff, mobility management. It will also cover system and standards issues including second generation, third generation, and fourth generation wireless communications standards and wireless LANs. Besides providing and overviewing current technologies, the emphasis on the course will be to identify the challenges that face the engineering of wireless communications networks.\n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EE 602 Analytical Methods in Electrical Engineering Syllabus-2.json",
    "course_code": "EE 602",
    "course_title": "Analytical Methods in Electrical Engineering",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Analytical Methods in Electrical Engineering (EE 602)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Shirantha Welikala\n    Description: This course focuses on introducing fundamental concepts and techniques in linear algebra together with their applications to state space analysis.\n    Learning Outcomes: Decompose a matrix into its LU decomposition using elementary operations. Solve linear algebraic equations using elementary operation and the reduced row-echelon form. Collaborate effectively in teams to solve complex theoretical problems in linear algebra. Carry out matrix operations including matrix multiplication and matrix inverse, and to calculate matrix determinant using different approaches. Represent a linear time-invariant system into its state space form and calculate the solution to the state space equation. Use linear algebraic techniques to analyze electrical/mechanical systems and predict their behavior. Diagonalize square matrices and find similarity transformations by means of eigenvalues and eigenvectors. Use MATLAB and least squares techniques to analyze data taken from an electrical/mechanical system. Recognize and achieve high levels of professionalism in work and understand subject-related ethical concerns and obligations.\n    Prerequisites: Freshman Year Calculus",
    "embedding_dim": 1536
  },
  {
    "filename": "EE 605 - Syllabus (Spring 2024).json",
    "course_code": "EE 605 / CS 505",
    "course_title": "PROBABILITY AND STOCHASTIC PROCESSES I",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: PROBABILITY AND STOCHASTIC PROCESSES I (EE 605 / CS 505)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Goran Djuknic, PhD\n    Description: Topics covered: Combinatorial Analysis, Axioms of Probability, Conditional Probability and Independence, Random Variables, Continuous Random Variables, Jointly Distributed Random Variables, Properties of Expectation, Limit Theorems, Introduction to Stochastic Processes.\n    Learning Outcomes: Evaluate probabilities in compound situations involving a sequence of operations using the axioms of probability, independence arguments, the law of total probability and Bayes's Theorem. Evaluate probabilities in situations consisting of a finite number of equally likely outcomes, using combinatorial methods. Model and evaluate in a probabilistic manner systems and situations involving continuous random variables (e.g., uniform, exponential, normal, etc). Model and evaluate in a probabilistic manner systems and situations involving discrete random variables (e.g., Bernoulli, binomial, geometric, hyper-geometric, negative binomial, Poisson, etc).\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EE 608WS Applied Modeling and Optimization Course Outline (3).json",
    "course_code": "EE 608WS",
    "course_title": "Applied Modeling and Optimization",
    "semester": "",
    "year": "",
    "text": "Course: Applied Modeling and Optimization (EE 608WS)\n    Semester:  \n    Credits: \n    Instructor: R. Chandramouli (Mouli)\n    Description: This is an introductory course on mathematical modeling of optimization problems and techniques for finding solutions.\n    Learning Outcomes: Model an optimization problem Solve unconstrained and constrained optimization problems Recognize a convex optimization problem Apply numerical techniques such as gradient descent Choose a software toolbox to solve an optimization problem Apply optimization techniques to machine learning and other areas\n    Prerequisites: Background in Calculus and Linear Algebra. MATLAB, Python or equivalent scientific programming skills.",
    "embedding_dim": 1536
  },
  {
    "filename": "EE 608WS Applied Modeling and Optimization Course Outline.json",
    "course_code": "EE 608WS",
    "course_title": "Applied Modeling and Optimization",
    "semester": "",
    "year": "",
    "text": "Course: Applied Modeling and Optimization (EE 608WS)\n    Semester:  \n    Credits: \n    Instructor: R. Chandramouli (Mouli)\n    Description: This is an introductory course on mathematical modeling of optimization problems and techniques for finding solutions.\n    Learning Outcomes: Model an optimization problem Solve unconstrained and constrained optimization problems Recognize a convex optimization problem Apply numerical techniques such as gradient descent Choose a software toolbox to solve an optimization problem Apply optimization techniques to machine learning and other areas\n    Prerequisites: Background in Calculus and Linear Algebra. MATLAB, Python or equivalent scientific programming skills.",
    "embedding_dim": 1536
  },
  {
    "filename": "EE-552_Syllabus_Spring2024.json",
    "course_code": "EE-CPE552-WS",
    "course_title": "Java",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Java (EE-CPE552-WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Yousef Abdelmalek\n    Description: This course is a hands-on intensive introduction to solving engineering problem using Java.\n    Learning Outcomes: Recognize the basic concepts of the programing languages Java Construct various Java statements, datatypes, such as integer, float, arrays, strings, and pointers Isolate and correct common errors and bugs in Java programs using debugging tools (e.g. IntelliJ, Eclipse, NetBeans) Understand class object and instantiation of classes. Apply object-oriented concepts that encapsulate internal details to solve real problems in Java Analyze Java programs based on end-user and developer requirements Understand and apply knowledge dealing with input and output scenarios\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EE-553_Syllabus_Spring24.json",
    "course_code": "EE553WS",
    "course_title": "Engineering Programming: C++",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Engineering Programming: C++ (EE553WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Yousef Abdelmalek\n    Description: This course is a fast-paced introduction to the C++ programming language, with an emphasis on good programming practices and how to be an effective programmer.\n    Learning Outcomes: Recognize the basic concepts of the programming languages C++ Construct various C++ statements, datatypes, such as integer, float, arrays, strings, and pointers Isolate and correct common errors and bugs in C++ programs using debugging tools (e.g. CLion, code blocks,..) Organize memory allocation and deallocation appropriately based on the program complexity Apply object-oriented concepts that encapsulate internal details to solve real problems in C++ Analyze C++ programs based on end-user and developer requirements Use appropriate C++ terminology in solving problems\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EE603WS_2024Fall_Syllabus.json",
    "course_code": "EE603WS",
    "course_title": "Linear System Theory",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Linear System Theory (EE603WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Rensheng Wang\n    Description: Exposing the student to analytic tools used in signal processing, communications and controls.\n    Learning Outcomes: Understand the concepts of linear and time-invariant (LTI) system Apply LTI to the general system analysis about the input and output relationships Implement Fourier transform to interpret the signal component decompositions Derive the digital filter systems\n    Prerequisites: EE348 or equivalent courses",
    "embedding_dim": 1536
  },
  {
    "filename": "EE603WS_2024_Spring_Syllabus.json",
    "course_code": "EE603WS",
    "course_title": "Linear System Theory",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Linear System Theory (EE603WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Rensheng Wang\n    Description: Exposing the student to analytic tools used in signal processing, communications and controls.\n    Learning Outcomes: Understand the concepts of linear and time-invariant (LTI) system Apply LTI to the general system analysis about the input and output relationships Implement Fourier transform to interpret the signal component decompositions Derive the digital filter systems\n    Prerequisites: EE348",
    "embedding_dim": 1536
  },
  {
    "filename": "EE627WS_2024Fall_Syllabus.json",
    "course_code": "EE627WS",
    "course_title": "Data Acquisition/Modeling/Analysis – Big Data Analytics",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Data Acquisition/Modeling/Analysis – Big Data Analytics (EE627WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Rensheng Wang\n    Description: Exposing the student to analytic tools used for data acquisitions, processing and modeling with the challenges in the big-data era.\n    Learning Outcomes: Analyze time-series and provide forecast Process huge volume set of data Prune and tune big data for feature selections Extra data inference/insights Tune the recommender system\n    Prerequisites: EE603",
    "embedding_dim": 1536
  },
  {
    "filename": "EE627WS_2024Spring_Syllabus.json",
    "course_code": "EE627WS",
    "course_title": "Data Acquisition/Modeling/Analysis – Big Data Analytics",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Data Acquisition/Modeling/Analysis – Big Data Analytics (EE627WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Rensheng Wang\n    Description: Exposing the student to analytic tools used for data acquisitions, processing and modeling with the challenges in the big-data era. Tapping into the powerful tool of data analytics to create strategic advantage and identify new business opportunities. The studied datasets can vary from the traditional pure numerical data sets to more text related social network data. It includes the data pre-processing, feature extraction, model comparisons and selections, model induction and related forecasting or predictions. Helping students extend the concepts learned in the EE prerequisites courses to more concrete applications scenarios, like predictive modeling, time series forecasting, e-Business recommendation systems etc, and learn how to apply appropriate analytic techniques and tools to analyzing the big data sets.\n    Learning Outcomes: Analyze time-series and provide forecast Process huge volume set of data Prune and tune big data for feature selections Extra data inference/insights Tune the recommender system\n    Prerequisites: EE603",
    "embedding_dim": 1536
  },
  {
    "filename": "EE628WS_2023Fall_Syllabus.json",
    "course_code": "EE628WS",
    "course_title": "Introduction to Deep Learning for Engineering",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Introduction to Deep Learning for Engineering (EE628WS)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Rensheng Wang\n    Description: This course covers the comprehensive introductions about deep learning techniques used by practitioners in industry and programming exercises with related deep learning software packages. It consists of three sections. The first part reviews the applied math and machine learning basics. The second part studies the industry practices with deep networks in convolutional networks, recurrent & recursive nets, regularization for deep learning, auto-encoders etc. The last one is to train the students with real industry data for deep learning tasks at the big-data platform. By the end of the course, students will have a thorough knowledge about the state-of-the-art approaches used in deep learning.\n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EE628WS_2024Spring_Syllabus.json",
    "course_code": "EE628WS",
    "course_title": "Introduction to Deep Learning for Engineering",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Introduction to Deep Learning for Engineering (EE628WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Rensheng Wang\n    Description: This course covers the comprehensive introductions about deep learning techniques used by practitioners in industry and programming exercises with related deep learning software packages. It consists of three sections. The first part reviews the applied math and machine learning basics. The second part studies the industry practices with deep networks in convolutional networks, recurrent & recursive nets, regularization for deep learning, auto-encoders etc. The last one is to train the students with real industry data for deep learning tasks at the big-data platform. By the end of the course, students will have a thorough knowledge about the state-of-the-art approaches used in deep learning.\n    Learning Outcomes: Formulate a problem that can be solved with deep learning Design the neural network architecture Select the proper model to fit various data resources\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 600 Syllabus.json",
    "course_code": "EM 600",
    "course_title": "Engineering Economics and Cost Analysis",
    "semester": "",
    "year": "",
    "text": "Course: Engineering Economics and Cost Analysis (EM 600)\n    Semester:  \n    Credits: 3\n    Instructor: Chong Ee\n    Description: Engineering Economics and Cost Analysis is an integral part of the Engineering Management program because it is focused on applications of economics and finance in making effective engineering decisions.\n    Learning Outcomes: Discover the analysis of financial data, the concept of interest rates and time value of money. Assess between alternative projects using a set of basic tools and techniques of engineering analysis, including the time value of money, internal rate of return and benefit cost ratio. Examine advanced engineering economics topics like depreciation of assets, after tax cash flows and inflation. Apply important decision-making tools like sensitivity analysis, risk analysis and simulation.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 600 Syllabus_Summer 23.json",
    "course_code": "EM 600",
    "course_title": "Engineering Economics and Cost Analysis",
    "semester": "Summer",
    "year": "2023",
    "text": "Course: Engineering Economics and Cost Analysis (EM 600)\n    Semester: Summer 2023\n    Credits: 3\n    Instructor: Chong Ee\n    Description: Engineering Economics and Cost Analysis is an integral part of the Engineering Management program because it is focused on applications of economics and finance in making effective engineering decisions.\n    Learning Outcomes: Discover the analysis of financial data, the concept of interest rates and time value of money. Assess between alternative projects using a set of basic tools and techniques of engineering analysis, including the time value of money, internal rate of return and benefit cost ratio. Examine advanced engineering economics topics like depreciation of assets, after tax cash flows and inflation. Apply important decision-making tools like sensitivity analysis, risk analysis and simulation.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 605 Syllabus.json",
    "course_code": "EM 605",
    "course_title": "Elements of Operations Research",
    "semester": "",
    "year": "",
    "text": "Course: Elements of Operations Research (EM 605)\n    Semester:  \n    Credits: \n    Instructor: \n    Description: This course brings a strong modeling approach to the process of obtaining and utilizing resources to produce and deliver useful goods and services to not only meet the goals of an organization but to optimize the use of resources in meeting those goals.\n    Learning Outcomes: Develop appropriate operations research models based on theoretical standards. Judge the suitability of models based on the assessment of performance and applicability. Utilize appropriate software analysis tools for various analyses and situations. Propose relevant solutions to various levels of managerial staff.\n    Prerequisites: Knowledge of probability and statistics",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 612 Project Management of Complex System -Spring 24 Syllabus (1).json",
    "course_code": "EM 612",
    "course_title": "Project Management of Complex Systems",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Project Management of Complex Systems (EM 612)\n    Semester: Spring 2024\n    Credits: 3\n    Instructor: John Mikruk\n    Description: Project Management of Complex Systems is a project-based course that exposes students to tools and methodologies useful for the effective management of systems engineering and engineering management projects.\n    Learning Outcomes: Evaluate guidelines, principles, and tools of project management. Analyze factors in creating a project organization, culture, and team. Adapt quantitative techniques to project planning, risk, performance, and monitoring, including stakeholder management. Differentiate between waterfall and agile development benefits and costs in specific environments involving both software and hardware development as well as top-down versus distributed management hierarchical control structures. Examine interdependencies in the project management of complex systems versus those in obvious, complicated, and chaotic systems using an analytical framework.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 612 Project Management of Complex Systems - Fall 2024 Syllabus.json",
    "course_code": "EM 612WN",
    "course_title": "PROJECT MANAGEMENT OF COMPLEX SYSTEMS",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: PROJECT MANAGEMENT OF COMPLEX SYSTEMS (EM 612WN)\n    Semester: Fall 2024\n    Credits: 3\n    Instructor: Robert Zotti, PhD\n    Description: Project Management of Complex Systems is a project-based course that exposes students to tools and methodologies useful for the effective management of systems engineering and engineering management projects.\n    Learning Outcomes: Evaluate guidelines, principles, and tools of project management. Analyze factors in creating a project organization, culture, and team. Adapt quantitative techniques to project planning, risk, performance, and monitoring, including stakeholder management. Differentiate between waterfall and agile development benefits and costs in specific environments involving both software and hardware development as well as top-down versus distributed management hierarchical control structures. Examine interdependencies in the project management of complex systems versus those in less complex situations using an analytical framework.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 612 Project Management of Complex Systems.json",
    "course_code": "EM 612",
    "course_title": "Project Management of Complex Systems",
    "semester": "",
    "year": "",
    "text": "Course: Project Management of Complex Systems (EM 612)\n    Semester:  \n    Credits: \n    Instructor: \n    Description: \n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 622 Syllabus_Summer_23.json",
    "course_code": "EM 622",
    "course_title": "Data Analysis and Visualization Techniques for Decision-Making",
    "semester": "Summer",
    "year": "2023",
    "text": "Course: Data Analysis and Visualization Techniques for Decision-Making (EM 622)\n    Semester: Summer 2023\n    Credits: \n    Instructor: Sergio Luna\n    Description: This course provides a hands-on introduction to the modern techniques for visualizing data and leverages such techniques with the corresponding problem-solving skills necessary to complement data visualization into specific strategic decision making.\n    Learning Outcomes: Determine appropriate visualization charts based on data attributes and analysis. Assess data-driven projects by evaluating data analytics frameworks and the respective lifecycle phases. Analyze projects through the lens of critical thinking by answering 5WH questions, and contextualizing the 'so-what'. Create Python scripts to develop visualization charts. Generate data-driven insights by loading, cleaning, transforming, and visualizing datasets using Python. Develop static and interactive charts to visualize scenarios such as change over time, spatial visualizations, distribution and variation, correlation, magnitude by category, part-to-whole, network graphs, and text data. Formulate a data analytics project manuscript and presentation describing clear project objectives, explaining the data analytics process implemented, and summarizing the study into key insights and recommendations for stakeholders.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 623_Syllabus_Spring 23.json",
    "course_code": "EM 623",
    "course_title": "Data Science and Knowledge Discovery in Engineering Management",
    "semester": "Spring",
    "year": "2023",
    "text": "Course: Data Science and Knowledge Discovery in Engineering Management (EM 623)\n    Semester: Spring 2023\n    Credits: \n    Instructor: Sergio Luna PhD\n    Description: This course will examine methods that have emerged from both fields and proven to be of value in recognizing patterns and making predictions from an applications perspective.\n    Learning Outcomes: Analyze problems of interest through the lens of critical thinking and contextualizing the 'so-what?' Identify proper analytical strategies to extract actionable information from data Formulate solutions that considers structured and unstructured data attributes Generate data-driven insights by implementing machine learning algorithms Incorporate some of the most popular tools for data analysis, text mining, and network analysis Formulate a data analytics manuscript and project presentation that explores data life cycles\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 624 Syllabus.json",
    "course_code": "EM 624",
    "course_title": "Data Exploration and Informatics for Engineering Management",
    "semester": "",
    "year": "",
    "text": "Course: Data Exploration and Informatics for Engineering Management (EM 624)\n    Semester:  \n    Credits: 3\n    Instructor: Carlo Lipizzi\n    Description: This course enables the engineering management student to acquire the knowledge and skills they will need to handle the variety and volume of information encountered in today’s workplace.\n    Learning Outcomes: Conduct data analysis from different data sources. Develop Python programs involving Python libraries to manipulate, process, and visualize data. Apply machine learning techniques for data processing. Analyze various types of information used in today’s business environment. Describe the role of software development in today’s business environment.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 680 WS Syllabus Spring 2022.json",
    "course_code": "EM 680 WS",
    "course_title": "The management of the Development Enterprise",
    "semester": "Spring",
    "year": "2022",
    "text": "Course: The management of the Development Enterprise (EM 680 WS)\n    Semester: Spring 2022\n    Credits: \n    Instructor: Luca Iandoli\n    Description: This course introduces the attributes associated with the design and management of the human activity system that is responsible for developing and operating an organization.\n    Learning Outcomes: Develop a scientific understanding of organizational behavior concepts and theories and their applications to management context and work situations. Apply several methodologies for organizational analysis based on system thinking perspective. Develop skills and techniques to effectively design and manage engineering teams in organizations.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM 800 Syllabus.json",
    "course_code": "EM 800",
    "course_title": "Special Projects in Engineering Management",
    "semester": "",
    "year": "",
    "text": "Course: Special Projects in Engineering Management (EM 800)\n    Semester:  \n    Credits: \n    Instructor: Carlo Lipizzi\n    Description: This course is on a 'special project' and it has the following main components: Define how a project-oriented topic should be developed, Define criteria and methods to determine the topic and the data sources for the project, Develop a project on the selected topic.\n    Learning Outcomes: Frame complex problems into research steps Match research questions with data to support the process to address them Prepare the data for the analysis Create a model to extract the metrics required to address the research questions Create visualizations as needed to better present the value of the metrics in addressing the questions Create a narrative to frame the findings and addressing the questions in a plain readable format Present the results Place information in the context of the defined issues as they work to rebuild/build. Solve complex problems for the immediacy and in relation to the larger picture.\n    Prerequisites: This is a capstone project, to be taken close to the end of the program",
    "embedding_dim": 1536
  },
  {
    "filename": "EM605 Syllabus - Fall 2024 v1.json",
    "course_code": "EM 605",
    "course_title": "Elements of Operations Research",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Elements of Operations Research (EM 605)\n    Semester: Fall 2024\n    Credits: \n    Instructor: David R. Nowicki, Ph.D.\n    Description: This course strongly emphasizes modeling to obtain and utilize resources to produce and deliver valuable goods and services to meet the organization’s goals.\n    Learning Outcomes: Build operations research models of complex systems. Use software packages for the solution of management problems. Understand the results of computer modeling. Apply the appropriate analytical technique to real-world problems. Summarize and present analysis results clearly and coherently.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM612_PM_Syllabus_Fall2024_WS1.json",
    "course_code": "EM 612-WS1",
    "course_title": "Project Management of Complex Systems",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Project Management of Complex Systems (EM 612-WS1)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Ali Yassine, Ph.D.\n    Description: Project Management of Complex Systems is a project-based course that exposes students to tools and methodologies useful for the effective management of systems engineering and engineering management projects.\n    Learning Outcomes: Build a solid foundation in the guidelines and principles of project management. Identify considerations in creating a project organization, culture, and team. Learn how to apply quantitative techniques to project planning, risk, performance, and monitoring. Build a fundamental understanding of the tools of project management. Establish the building blocks for the management of complex systems.\n    Prerequisites: Basic knowledge of probability and statistics",
    "embedding_dim": 1536
  },
  {
    "filename": "EM624_Syllabus.json",
    "course_code": "EM 624",
    "course_title": "Informatics for Engineering Management",
    "semester": "",
    "year": "",
    "text": "Course: Informatics for Engineering Management (EM 624)\n    Semester:  \n    Credits: \n    Instructor: Dr. Carlo Lipizzi\n    Description: \n    Learning Outcomes: Design and carry out an analysis of data files. Use Python and tools in the Python libraries to manipulate and analyze data. Analyze a variety of types of information used in today’s business environment. Describe the role of software development in today’s business environment.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EM665-S24-Syllabus.json",
    "course_code": "EM 665",
    "course_title": "Integrated Supply Chain Management",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Integrated Supply Chain Management (EM 665)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Dr. Kathryn Abel\n    Description: This course illustrates the theory and practice of designing and analyzing supply chains.\n    Learning Outcomes: Identify and discuss supply chain drivers and their effect on supply chain performance. Develop performance metrics for supply chains, and design networks for integration. Perform demand forecasting, aggregate planning, and evaluate the effect on inventory/supply. Investigate all factors of supply chain integration through the research and presentation of case studies.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "EMT 696 WZ  HCDT Syllabus 7.28.22 Leibler.json",
    "course_code": "EMT 696",
    "course_title": "Human Centered Design Thinking",
    "semester": "Fall",
    "year": "2022",
    "text": "Course: Human Centered Design Thinking (EMT 696)\n    Semester: Fall 2022\n    Credits: \n    Instructor: Renée Leibler\n    Description: This course is focused on the theory and methods for approaching a human design problem.\n    Learning Outcomes: Critically discuss potential design methodologies for a given problem. Obtain information about users and activities through observation and systematic inquiry. Employ various design methods (i.e. ideation techniques, storyboarding, sketching, etc.) to identify a solution. Gather user data through prototyping of your proposed solution.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "F2024 CM-EN545WS Environmental Impact Assessment and Planning Syllabus.json",
    "course_code": "EN/CM545WS",
    "course_title": "Environmental Impact Assessment and Planning",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Environmental Impact Assessment and Planning (EN/CM545WS)\n    Semester: Fall 2024\n    Credits: 3\n    Instructor: Karim S. Karam\n    Description: The built environment, while necessary for economic growth, and improving quality of life impacts our physical, cultural and socioeconomic environment, as well as the natural environment. The first part of the course is concerned with environmental planning techniques and strategies. Topics include the management of sustainability, environmental governance and the changing role of civil society, through integrated assessments combining environmental impact assessments (EIA) with cost benefit and risk assessments. The second part of the course is concerned with planning and designing sustainable infrastructure systems. Topics include sustainability rating systems for vertical and horizontal infrastructure, and sustainable project financing. The course includes case studies from around the world.\n    Learning Outcomes: Understand the potential impact of development on environmental quality, social well-being and the regional economy Utilize and explain environmental assessment methods used to quantify and analyze these impacts, by developing Environmental Impact Statements Perform systematic socio-economic and environmental cost benefit analyses, and risk assessment, and understand the challenges involved. Plan and design sustainable infrastructure systems by understanding and making use of sustainability rating systems\n    Prerequisites: Senior or graduate status or permission from the instructor",
    "embedding_dim": 1536
  },
  {
    "filename": "F2024 CM501 Construction Engineering 1 Syllabus.json",
    "course_code": "CM501",
    "course_title": "Construction Engineering 1",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Construction Engineering 1 (CM501)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Karim S. Karam\n    Description: This course provides a comprehensive overview of construction engineering methods, techniques and equipment.\n    Learning Outcomes: Organize and plan projects Perform preliminary cost estimates, quantity take offs, and bid cost estimates. Understand and plan basic construction activities, and identify the resources required to perform them. Produce a construction management plan Manage the construction process through monitoring productivity and economics.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "F2024 CM512WS Problems In Heavy Construction Syllabus.json",
    "course_code": "CM512WS",
    "course_title": "Problems in Heavy Construction",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Problems in Heavy Construction (CM512WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Karim S. Karam\n    Description: Infrastructure systems are critical for the functioning of society and economic growth. Engineers and managers are often faced with problems during the development and delivery of most infrastructure systems, particularly larger projects that are typically more complex.\n    Learning Outcomes: Identify major sources of uncertainties in construction projects. Understand the sources of risks in infrastructure development and delivery. Develop and update a construction risk register, and mitigation measures where necessary. Understand and apply engineering best practice drawn from the project learning of past experience.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "FA 631_syllabus.json",
    "course_code": "FA631",
    "course_title": "Investment, Portfolio Construction and Trading Analytics",
    "semester": "Spring",
    "year": "2023",
    "text": "Course: Investment, Portfolio Construction and Trading Analytics (FA631)\n    Semester: Spring 2023\n    Credits: \n    Instructor: Germán Creamer\n    Description: This is an applied research course that explores how to apply fundamental machine learning models for financial prediction, algorithmic trading, model calibration, and portfolio optimization.\n    Learning Outcomes: Apply statistical models and analytical methods to the finance domain. Recognize the value and limits of statistical learning algorithms to solve financial problems. Develop analytical models for financial forecasting, portfolio optimization, and trading.\n    Prerequisites: A Machine learning course or similar training.",
    "embedding_dim": 1536
  },
  {
    "filename": "FA691 S24 Syllabus.json",
    "course_code": "FA691",
    "course_title": "Deep Learning for Finance",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Deep Learning for Finance (FA691)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Zachary Feinstein\n    Description: This course is designed for Master and Ph.D. graduate students and advanced undergraduates. The purpose is to learn to apply machine learning techniques to financial problems.\n    Learning Outcomes: Be able to apply neural networks to financial problems Be able to evaluate the performance of different methods to determine the best method/hyperparameters Learn how to interpret results of machine learning in a financial context Create and apply neural network models for regression and classification tasks in finance Evaluate performance of trained machine learning models Understand applicability of diverse techniques in deep learning\n    Prerequisites: FA 590",
    "embedding_dim": 1536
  },
  {
    "filename": "FA692 S24 Syllabus.json",
    "course_code": "FA692",
    "course_title": "Natural Language Processing for Financial Applications",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Natural Language Processing for Financial Applications (FA692)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Zachary Feinstein\n    Description: This course focuses on natural language processing (NLP) models and their applications to finance.\n    Learning Outcomes: Be able to apply NLP to financial problems Be able to evaluate the performance of different methods to determine the best method/hyperparameters Learn how to interpret results of NLP in a financial context Create and apply NLP models for analyzing financial reports and news Evaluate performance of trained NLP models for sentiment analysis Understand applicability of diverse NLP techniques\n    Prerequisites: FA 590",
    "embedding_dim": 1536
  },
  {
    "filename": "FE 517 Mod00_Syllabus.json",
    "course_code": "FE 517",
    "course_title": "Financial Lab: SAS for Finance",
    "semester": "Spring",
    "year": "2013",
    "text": "Course: Financial Lab: SAS for Finance (FE 517)\n    Semester: Spring 2013\n    Credits: \n    Instructor: Khasha Dehnad\n    Description: In this course the students will learn the basics of SAS programming using financial data and applications. The course provides an introduction to programming, graphics, and data analysis using SAS Software. The course concentrates on fundamental components of SAS Software: data processing, managing SAS libraries, graphical and statistical procedures, creating, formatting and exporting reports. In addition, several advanced topics will be introduced: SAS SQL procedures and SAS Macro Language.\n    Learning Outcomes: Create SAS datasets. Merge and combine multiple SAS datasets. Perform basic statistical analysis. Visualize the data. Develop SAS macros. Develop statistical and time series models with financial applications.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "FE511 S24- Syllabus.json",
    "course_code": "FE-511A/WS",
    "course_title": "Introduction to Bloomberg and Thomson Reuters",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Introduction to Bloomberg and Thomson Reuters (FE-511A/WS)\n    Semester: Spring 2024\n    Credits: 1\n    Instructor: Agathe Sadeghi\n    Description: This course is designed to teach students the nature and availability of financial data at Stevens.\n    Learning Outcomes: Navigate the available data using the Bloomberg terminal. Retrieve relevant information for your projects. Learn how to use Bloomberg API (R and EXCEL). Navigate through Capital IQ database. Learn how to use Capital IQ API (EXCEL). Learn how to run queries in WRDS.\n    Prerequisites: This course is a prerequisite for any practical or empirical project using real data in Finance at graduate level. Every student enrolled in the capstone project course FE800 or planning to do a Thesis FE900 should have taken this course.",
    "embedding_dim": 1536
  },
  {
    "filename": "FE515_WS_syllabus 2024F.json",
    "course_code": "FE-515",
    "course_title": "Introduction to R-WS",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Introduction to R-WS (FE-515)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Beichen Zhang\n    Description: This course aims at helping students from Financial Engineering and Financial Analytics with core courses study.\n    Learning Outcomes: Use the basic syntax in R: if-else statement, loops, self-defined functions, etc. Generate plots for analyzing data (e.g. scatter plot, bar plot, box plot). Use data downloading packages to download stock and option data, read and write the date into .csv file. Construct linear model for prediction and use stepwise regression for model selection. Apply root finding methods (to calculate yield of bonds or implied volatility of options). Generate random number for simulation (e.g. Monte-Carlo simulation for Black Scholes Model). Solve optimization problems with R packages (e.g. Quadratic programming for Portfolio optimization). Interpolate data (e.g. Interpolate yield curve). Numerical integration (e.g. Calculate option price with numerical integration).\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "FE621_syllabus_spring24.json",
    "course_code": "FE 621",
    "course_title": "Computational Methods in Finance",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Computational Methods in Finance (FE 621)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Sveinn Ólafsson\n    Description: Provide students with understanding of essential computational tools used by quantitative analysts in the financial industry.\n    Learning Outcomes: Understanding of essential computational tools used by quantitative analysts in the financial industry. Ability to apply these tools to forecasting, asset pricing, hedging, risk management, and other financial applications.\n    Prerequisites: Stochastic calculus at the level of FE543/FE610.",
    "embedding_dim": 1536
  },
  {
    "filename": "FIN 500 Syllabus.json",
    "course_code": "FIN-500",
    "course_title": "Financial and Managerial Accounting",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Financial and Managerial Accounting (FIN-500)\n    Semester: Fall 2024\n    Credits: 3\n    Instructor: Dr. Ryan Wynne\n    Description: This course will provide the student with the principles and techniques of financial and managerial accounting for technical organizations.\n    Learning Outcomes: Critically analyze financial statements, with a full appreciation of the inherent limitations of reported financial information. Employ ratio and trend analyzes to evaluate the condition and performance of business entities. Apply the concepts of present value analysis to valuing assets and making appropriate business decisions. Create departmental/corporate budgets. Generate and use financial data to make effective business decisions, including make/buy, capital investment, product introduction timing, etc. Interpret cost accounting data to support operating decisions and cost reduction efforts.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "FIN 510 Web Course Syllabus Spring 2024-1.json",
    "course_code": "FIN 510/ACC 510-WS",
    "course_title": "Analysis of Financial Statements",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Analysis of Financial Statements (FIN 510/ACC 510-WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Mark Hefter, JD, LLM, CPA\n    Description: The course is part of the Finance Core for the Master of Science in Finance which is one of the Stevens programs that is in the CFA University Affiliation Program. As such, it maps at least 70% to the CFA Candidate Body of Knowledge for Financial Statement Analysis.\n    Learning Outcomes: Describe the accounting principles for documenting economic events that affect a firm’s financial position. Demonstrate proficiency in financial reporting mechanics, including the effect of transactions and adjusting entries on financial statements. Read and understand basic financial statements such as the income statement, balance sheet, statement of changes in shareholders’ equity, and statement of cash flows. Understand the accounting choices that companies make and the implications of these choices for the information presented in a company’s financial statements. Employ financial analysis techniques to evaluate short-term and long-term firm performance, particularly on the following dimensions: profitability, efficiency, liquidity, and solvency. Evaluate the alignment between short term financial outcomes and long-term strategic goals. Understand the differences and similarities between US (federal and state) and international financial reporting standards and multinational reporting requirements of companies. Increase their familiarity with the use of financial databases and sources of financial information such as EDGAR, Bloomberg, Marketwatch, Morningstar, etc. Appreciate the legal and regulatory environment of financial reporting, ethical issues and best practices designed to avoid ethical lapses.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "FIN 530 Wang_Syllabus_2024Fall.json",
    "course_code": "FIN 530",
    "course_title": "Investment Banking",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Investment Banking (FIN 530)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dr.Ye (Emma) Wang\n    Description: The course provides an overview of Investment Banking from a transactional, regulatory and legal perspective.\n    Learning Outcomes: Capital Markets, Market Structure, Participants Evolution of Financial Institutions - Commercial Banks, Investment Banks, Global Banks, Securities Firms/Broker-Dealers, Financial Intermediaries (Investment Companies). From the Glass-Steagall Act to the Dodd-Frank Regulatory Reform and the Capital Adequacy Tests (CCAR) The Legal Structure of a Firm: Capital Structure, Capital Markets vs Bank Financing, IPOs, SPACs, Secondary Offerings The Value of a Firm: Book Value, Market Value, Enterprise Value - Levered Equity, WACC, Discounted Cash Flows (DCF), Peer Valuation Debt Financing, LBOs, CLOs, Mortgage Financing, MBS, REITs M&A, Cross-Border Transactions, Taxes, CIFIUS transaction review and approvals\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "FIN 627 Syllabus - Spring 2024.json",
    "course_code": "FIN 627",
    "course_title": "Investment Management",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Investment Management (FIN 627)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Katherine Hodsdon\n    Description: This is an introductory course to the theory and practice of investment management. It covers the building blocks and fundamental theoretical and practical aspects of managing investments as well as applications that put the former to use by practitioners in the industry.\n    Learning Outcomes: Create the discipline and analytical processes that underscore the objective of building investor wealth. Comprehend how both fundamental securities analysis and market behavior impact the short- and long-term value of securities. Achieve a critical understanding of the most widely used theories and practices in investment analysis and management today. Construct and manage equity portfolios based on selected objectives and styles.\n    Prerequisites: FIN 623 completion of an online course (MOOC) on Financial Management",
    "embedding_dim": 1536
  },
  {
    "filename": "FIN 628_AACSB Syllabus_2024 - 15-Aug-2024.json",
    "course_code": "FIN 628",
    "course_title": "Derivatives",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Derivatives (FIN 628)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Emmanuel D. Hatzakis\n    Description: This course covers the fundamentals of financial derivatives, including the basic properties and the pricing of futures, options and swaps. It also explores trading and hedging strategies involving financial derivatives.\n    Learning Outcomes: Describe how options, futures and swaps function Implement option pricing models, such as Black & Scholes and Binomial Trees Estimate implied volatility smiles Implement pricing models using binomial trees Describe the pros and cons of the use of derivatives for speculative investing Design and implement portfolio trading and hedging strategies using derivatives\n    Prerequisites: FIN 523 Completion of an online course (MOOC) on Financial Management",
    "embedding_dim": 1536
  },
  {
    "filename": "FIN 638A_Syllabus_Spring_2024.json",
    "course_code": "FIN 638A",
    "course_title": "Corporate Finance",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Corporate Finance (FIN 638A)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Dr. Suman Banerjee\n    Description: This introductory graduate-level course provides a market-oriented framework for analyzing the major types of financial decisions made by corporations.\n    Learning Outcomes: Understand an organization's four principal activities: conducting operations, establishing goals and strategies, making investments, and obtaining financing. Understand the purpose and content of the three principal financial statements: balance sheet statement, cash flow statement, and income statement. Have basic idea about mergers and acquisitions, financial decision-making, debt, and corporate restructuring.\n    Prerequisites: Financial and Managerial Accounting (FIN 600) Financial Statement Analysis (FIN 510) Economics for Managers (MGT 606)",
    "embedding_dim": 1536
  },
  {
    "filename": "FIN 658 - Wealth Management Principles and Practices - Fall 2023.json",
    "course_code": "FIN 658",
    "course_title": "Wealth Management Principles and Practices",
    "semester": "Fall",
    "year": "2021",
    "text": "Course: Wealth Management Principles and Practices (FIN 658)\n    Semester: Fall 2021\n    Credits: 3 credit\n    Instructor: Emmanuel D. Hatzakis\n    Description: This is a course on the theory and practice of wealth management. It covers the building blocks and fundamental theoretical and practical aspects of investment management and financial planning for individual investors as well as applications that put the former to use by practitioners in the industry.\n    Learning Outcomes: Master the framework of building and managing investor wealth Apply a systematic process for constructing investment portfolios that help clients achieve their life goals Understanding how investment analysis and management, and behavioral finance are synthesized in the practice of wealth management View the investor-client relationship as an ongoing process, which ensures that the client’s wealth is managed such that the client’s life goals remain on track to be served\n    Prerequisites: Private Equity & Venture Capital (FIN 626) Investment Management (FIN 627) Portfolio Theory and Applications (FE 630) Derivatives (FIN 628) Pricing and Hedging (FE 620) Fixed Income (FIN 629)",
    "embedding_dim": 1536
  },
  {
    "filename": "FIN 688A_Syllabus_Fall_2023.json",
    "course_code": "FIN 688",
    "course_title": "Mergers, Acquisitions and Other Corporate Restructuring",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Mergers, Acquisitions and Other Corporate Restructuring (FIN 688)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Dr. Suman Banerjee\n    Description: Finance stands as the foundation of profit-driven enterprises. This core finance course equips students with skills and knowledge essential for diverse career paths, encompassing various investment types (especially in debt-involved firms), specialized investment situations, financial advisory roles, and finance research.\n    Learning Outcomes: Assessing both theoretical and practical research within the realms of mergers and acquisitions, initial public offerings, corporate carve-outs, and spinoffs. Grasping the ramifications of corporate insolvency and restructuring on the wealth of stakeholders. Contrasting diverse models for making investment and divestiture choices amid uncertainty. Recognizing the legal dimensions of corporate investment and divestiture determinations, along with the impacts of legal risk on stakeholders’ wealth. Applying ethical frameworks to scrutinize organizational decision-making within the financial context.\n    Prerequisites: FIN 638: Corporate Finance FIN 616: Managerial Economics FIN 510: Financial Statement Analysis FIN 628: Derivatives Instructor’s consent",
    "embedding_dim": 1536
  },
  {
    "filename": "FIN620WSsyllabus_spring24.json",
    "course_code": "FIN620",
    "course_title": "Financial Econometrics",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Financial Econometrics (FIN620)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Prof Pallavi Pal\n    Description: This course will cover the main topics of the analysis of time series to evaluate risk and return of the main products of capital markets.\n    Learning Outcomes: Understand the foundations of financial time series data, including high-frequency data Apply models and methods for analysis of financial time series (return and volatility) and risk management. Recognize the value and also the limits of econometric methods in financial time series.\n    Prerequisites: BIA 652 Multivariate data analytics MGT 700 Econometrics",
    "embedding_dim": 1536
  },
  {
    "filename": "MA 540 Syllabus.json",
    "course_code": "MA 540",
    "course_title": "Introduction to Probability Theory",
    "semester": "",
    "year": "",
    "text": "Course: Introduction to Probability Theory (MA 540)\n    Semester:  \n    Credits: 3\n    Instructor: Paul Schwartz\n    Description: Introduction to Probability Theory aims to provide solid foundations of probability theory without requiring prior knowledge on measure theory.\n    Learning Outcomes: Determine the conditional probability using Bayes’ theorem. Infer a suitable probability distribution function from a sufficient number of samples. Determine the expectation and (co)variance of random variables and random vectors, exploit the properties of the former, and apply the inequalities related to moments. Compare and relate the different modes of convergence. Analyze the convergence of random variables under certain conditions. Prove basic concentration inequalities and based on that explain the rationale behind certain applications/algorithms in data analytics. Compare the two discussed versions of the PageRank algorithms explaining how one addresses the flaws of the other and explain the mathematical concepts behind the PageRank Algorithm.\n    Prerequisites: Advanced Calculus",
    "embedding_dim": 1536
  },
  {
    "filename": "MA 544 Syllabus.json",
    "course_code": "MA 544",
    "course_title": "Numerical Linear Algebra for Big Data",
    "semester": "",
    "year": "",
    "text": "Course: Numerical Linear Algebra for Big Data (MA 544)\n    Semester:  \n    Credits: 3\n    Instructor: Upendra Prasad, PhD\n    Description: This course will introduce foundational ideas as well as advanced techniques in linear algebra that are employed in the computational science of Big Data.\n    Learning Outcomes: Apply foundational linear algebra concepts and understand several advanced linear algebra topics that are useful in handling high-dimensional data. Employ matrix/tensor representation of real-life data such as images, documents, and signals. Implement numerical linear algebra techniques for linear systems of equations, for solutions using various methods including matrix decomposition and iterative methods. Analyze various aspects of numerical approximation algorithms, including efficiency, accuracy, and stability. Apply matrix calculus and optimization for developing and implementing machine learning algorithms based on gradient descent and other methods. Evaluate and compare different algorithms in terms of complexity, cost of computation, and accuracy. Efficiently implement algorithms in Python. Apply advanced numerical linear algebra techniques for dimension reduction. Create matrix representations of graphs and networks. Create popularity ranking methods such as page ranking and social media standing based on network analysis. Perform clustering on data based on different metrics including similarity and associativity. Perform efficient transformation of data for various applications. Exploit sparseness in data and their matrix representation for economic and efficient operations.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MA 574-WN Syllabus.json",
    "course_code": "MA 574",
    "course_title": "Foundational Mathematics for Data Science",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Foundational Mathematics for Data Science (MA 574)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Upendra Prasad\n    Description: This course provides students with the essential background in calculus and linear algebra needed to pursue the study of Data Science.\n    Learning Outcomes: Perform algebraic operations on vectors and matrices Solve systems of linear equations Distinguish vector subspaces and find bases for them Calculate projection matrices and least squares estimates Find eigenvalues and eigenvectors of square matrices, the eigen decomposition when possible, and the singular value decomposition of arbitrary matrices Compute partial derivatives, gradients, and integrals of multivariate functions Find Taylor polynomials and Taylor series of single variable and multivariable functions and use them to approximate functions Optimize basic single variable and multivariable functions\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MA 576 Syllabus.json",
    "course_code": "MA 576",
    "course_title": "Optimization for Data Science",
    "semester": "Spring",
    "year": "2022",
    "text": "Course: Optimization for Data Science (MA 576)\n    Semester: Spring 2022\n    Credits: 3 credits\n    Instructor: Pedro Vilanova-Guerra\n    Description: The objective of this course is to introduce the students to the theory and methods of optimization used in data science.\n    Learning Outcomes: Use subgradients of convex functions and stochastic subgradients both for the purpose of theoretical analysis as well as in numerical methods. Use Lagrange duality in numerical methods and in decomposition approaches. Apply subgradient calculus to calculate subgradients of the dual functions applying Fenchel-Moreau theorem, Rockafellar-Moreau theorem and other results. Apply the first order necessary conditions of optimality for problems with differentiable and non-differentiable functions including the verification of appropriate constraint qualification conditions. Verify the optimality of points by the first- and second-order sufficient optimality conditions. Apply the basic steps of the numerical methods listed in the syllabus; be aware of their convergence assumptions, advantages and disadvantages; choose an appropriate numerical method for a given problem. Apply the fundamental decomposition and distribution approaches to create tailored distributed methods for particular applied problems. They will be aware of the applicability and convergence properties of the methods. Use stochastic approximation and randomized techniques; identify when these techniques are needed and how to apply them. Formulate a sample-based optimization problem and be aware of the necessary probabilistic guarantees for its solution.\n    Prerequisites: Undergraduate knowledge of multivariate calculus linear algebra probability",
    "embedding_dim": 1536
  },
  {
    "filename": "MA 641 Syllabus.json",
    "course_code": "MA 641",
    "course_title": "Time Series Analysis I",
    "semester": "",
    "year": "",
    "text": "Course: Time Series Analysis I (MA 641)\n    Semester:  \n    Credits: 3\n    Instructor: Hadi Safari Katesari\n    Description: The course will provide a basic introduction to modern time series analysis from both a theoretical and applied point of view.\n    Learning Outcomes: Summarize and diagram time series data in statistical format. Apply stationary (ARMA) and nonstationary (ARIMA) time series models. Apply model specification and diagnostic for stationary and nonstationary times series models. Compute parameter estimation for time series models via statistical methods such as maximum likelihood. Predict the values for time series at future time points and interpret the results. Apply statistical techniques into seasonal time series (SARMA) modeling. Identify well-known time series models such as ARCH and GARCH. Apply spectral analysis, nonlinear models, and threshold models. Apply multivariate time series analysis.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "ME-511WS-24F Syllabus.json",
    "course_code": "ME-511WS",
    "course_title": "Wind Energy, Theory & Application",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Wind Energy, Theory & Application (ME-511WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Charles Cohn\n    Description: This course provides a description of the fundamentals of converting wind energy to electricity and its effective use for a variety of applications.\n    Learning Outcomes: Understand the factors that influence the use wind power as an energy source. Use of wind speed instruments. Identify the various wind energy systems. Identify the components in wind turbines. Identify the towers and foundations used for onshore and offshore wind turbines. Predict wind energy production. Have the ability to apply design principles in selecting an appropriate wind energy system to meet requirements. Capable of analyzing/designing a wind energy system to either only generate electricity or run water pumps. Identify the economic and non-economic benefits of wind turbines. Identify the various energy storage capabilities.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "ME-519WS, '24F Syllabus.json",
    "course_code": "ME-519WS/MT-528WS",
    "course_title": "Solar Energy, System Designs",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Solar Energy, System Designs (ME-519WS/MT-528WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Charles Cohn\n    Description: This course provides an in-depth treatment of how to transfer the latest solar thermal and photovoltaic technologies available to real world applications.\n    Learning Outcomes: Determine azimuth and altitude angles of the sun by calculation or using a sun chart. Identify module tilt angle and orientation that provides maximum energy production. Identify the different types of PV Modules, thermal collectors, system components and materials used in the systems and determine their appropriate applications. Calculate the heat loads of buildings and analyze hot water loads. Compare different types of passive/active thermal systems and their advantages and disadvantages. Identify data required and size/design PV and passive/active Thermal Systems. Calculate PV System performance using the online PVWatts tool. Identify the economic and non-economic benefits of the solar systems. Perform energy audits of residential and commercial buildings and identify cost effective opportunities for energy savings.\n    Prerequisites: ME/MT-518 Course",
    "embedding_dim": 1536
  },
  {
    "filename": "ME510WS_Syllabus_Fall2024.json",
    "course_code": "ME510WS",
    "course_title": "POWER PLANT ENGINEERING",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: POWER PLANT ENGINEERING (ME510WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: H. Hadim\n    Description: \n    Learning Outcomes: Demonstrate understanding of the energy resources and energy conversion methods available for the production of electric power. Analyze the performance of steam power plants, including superheat, reheat, regeneration, and irreversibilities. Analyze the performance of gas turbines with reheat and regeneration, and the performance of combined cycle and cogeneration power plants. Demonstrate understanding of the principles of steam generators. Analyze fuels and combustion systems. Explain the basic principles of thermal-fission and fast-breeder nuclear power plants, such as pressurized-water, boiling-water, and heavy-water reactors. Demonstrate understanding of power generation from renewable sources: solar, wind, geothermal, ocean thermal. Demonstrate understanding of the principles and potential of direct-electric power conversion systems, such as fuel-cell and solar photovoltaic units. Demonstrate understanding of the environmental impact of electric power production on air quality, climate change, water, and land.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "ME513_CourseSyllabus Spring 2024.json",
    "course_code": "ME 513WS",
    "course_title": "Introduction to Nuclear Engineering",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Introduction to Nuclear Engineering (ME 513WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: H. Hadim\n    Description: This course is designed to provide students with a broad perspective of nuclear engineering and an introduction to fundamentals and applications of nuclear science and technology.\n    Learning Outcomes: Demonstrate an understanding of the fundamental concepts and principles of nuclear engineering and its applications. Demonstrate an introductory knowledge of current and future nuclear power systems. Describe processes and applications that make use of the energy released from the nucleus, using both analytical and descriptive methods. Demonstrate an understanding of nuclear reactions, nuclear radiation and nuclear reactor heat generation. Demonstrate an understanding of neutron transport behavior. Demonstrate an understanding of a nuclear steam supply system, nuclear safety and the nuclear fuel cycle. Demonstrate an understanding of radiation protection and perform shielding calculations for simple reactor systems. Demonstrate a general understanding of nuclear power plant systems, licensing, design, operation & maintenance, safety and security. Perform a general design of a nuclear power plant including performance, economic, environmental, safety and reliability, and other considerations.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "ME554 F24 Syllabus.json",
    "course_code": "ME554",
    "course_title": "Introduction to CAD",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Introduction to CAD (ME554)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Chan Yu\n    Description: Designs of modern products and processes are very complex, and complex designs rely heavily on computer-aided technologies. This course introduces the fundamentals of CAD and its application in design and manufacturing practices.\n    Learning Outcomes: understand the fundamentals of CAD/CAM systems including the principles and practice of computer-aided solid modeling and its applications to manufacturing. understand the functionality of computer-aided tools including CAD/CAM/CAE. make an appropriate selection of CAD functionality to use as tools in the product design process. use parametric modeling techniques to reflect engineering requirements. design a part or assembly of parts using Computer-Aided Design software like Creo Parametric. sketch and design parts in CAD using features (e.g., extrude, revolve, sweep, blend, etc.) run a static finite element analysis and design optimization using CAD Simulation tools.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "ME564 SU24 Syllabus.json",
    "course_code": "ME564",
    "course_title": "Optimization Principles in Mechanical Engineering",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Optimization Principles in Mechanical Engineering (ME564)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Chan Yu\n    Description: This course introduces traditional numerical optimization techniques that can be used to solve a wide variety of engineering optimization problems in the area of mechanical design and manufacturing.\n    Learning Outcomes: formulate mechanical engineering design as an engineering optimization problem select the appropriate numerical techniques and software tools to solve the engineering optimization problem solve the optimization problem using Excel Solver and Matlab Optimization Toolbox optimize the design using Solidworks design study and topology optimization tool\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "ME598WS_Syllabus.json",
    "course_code": "ME 598",
    "course_title": "Introduction to Robotics",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Introduction to Robotics (ME 598)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Mishah Uzziél Salman, Ph. D.\n    Description: This course introduces students to a breadth of foundational topics relevant to robotic manipulators and mobile robots.\n    Learning Outcomes: Apply mathematical foundations relevant for describing the geometry, motion, and behavior of robotic manipulators and wheeled mobile robots. Utilize mathematical methods for robot capability analysis and operation. Use software to perform analyses, generate programming code, and generate simulations for various robotic devices.\n    Prerequisites: Knowledge of differential equations and matrix analysis strongly recommended Familiarity with fundamentals of computer coding and MATLAB recommended",
    "embedding_dim": 1536
  },
  {
    "filename": "ME655_Syllabus_20240803.json",
    "course_code": "ME-655 (BME-656)",
    "course_title": "Wearable Robotics and Sensors",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Wearable Robotics and Sensors (ME-655 (BME-656))\n    Semester: Fall 2024\n    Credits: \n    Instructor: Damiano Zanotto, Ph.D.\n    Description: The goal of this course is to provide students with an understanding of advanced methods used in the design and control of wearable robots and in the analysis of human motion through wearable sensors.\n    Learning Outcomes: Identify kinematic and kinetic variables to quantitatively describe patterns of human locomotion. Systematically derive the conditions of kinematic compatibility between the human body and a wearable mechanism. Compare state-of-the-art actuator technology suitable for safe physical human-robot interaction (pHRI). Derive conditions of coupled stability for impedance controllers. Identify the most appropriate assistive or rehabilitation controller for a given application and implement/test the controller in simulation. Discuss state-of-the-art wearable sensing technology and related methods for human motion analysis and activity recognition. Apply supervised learning techniques to real-life data collected with wearable sensors, to infer and quantify the wearer’s motion.\n    Prerequisites: ME-598 - Introduction to Robotics",
    "embedding_dim": 1536
  },
  {
    "filename": "ME656_sp2024_Syllabus_2024_01_03.json",
    "course_code": "ME-656",
    "course_title": "Autonomous Navigation for Mobile Robots",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Autonomous Navigation for Mobile Robots (ME-656)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Prof. Brendan Englot\n    Description: Mobile robot geometry, kinematics, and dynamics. Control and estimation for autonomous vehicles. Motion planning, including discrete and continuous methods, and sampling-based planning. Simultaneous localization and mapping, including active SLAM and autonomous exploration with occupancy grids. Markov decision processes and partially observable Markov decision processes with application to mobile robots; planning under uncertainty. Introduction to supervised learning and reinforcement learning, including deep learning. Applications of machine learning to autonomous navigation.\n    Learning Outcomes: Apply the techniques of control system design and state estimation design to mobile robotic systems Model the disturbances that contribute uncertainty to mobile robotic systems Use computer simulation as a tool for predicting the performance of a mobile robot and parameterizing a suitable navigation solution Analyze the robotics research literature to understand contemporary issues of your interest in mobile robot navigation Evaluate modeling assumptions and algorithms to solve localization, mapping, and planning problems\n    Prerequisites: ME-598, Introduction to Robotics",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT 612 Syllabus_Rayburn.json",
    "course_code": "MGT 612-WN",
    "course_title": "Leader Development",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Leader Development (MGT 612-WN)\n    Semester: Summer 2024\n    Credits: 3.0\n    Instructor: Kalim Rayburn\n    Description: This course develops your leading and influencing capabilities.\n    Learning Outcomes: Critique your leadership strengths and identify opportunities to develop personal/professional areas for growth. Engage in the processes of personal leader development. Distinguish among key theories and principles used to study leaders and leadership and apply these theories and principles to real-world situations. Utilize key skills and competencies to lead, influence, and build relationships.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT 635-WN Syllabus_Summer24.json",
    "course_code": "MGT 635-WN",
    "course_title": "Managerial Judgment and Decision Making",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Managerial Judgment and Decision Making (MGT 635-WN)\n    Semester: Summer 2024\n    Credits: 3\n    Instructor: Michele Lewski\n    Description: The objective of this course is to help students understand how decisions are made, why they are often less than optimal, and how decision-making can be improved.\n    Learning Outcomes: Evaluate past decisions and explore why decision-making can be challenging Assess decision-making from a psychological, statistical, and rational model perspective Analyze the limits of rational thinking – biases, emotions, and uncertainty and how to overcome them Apply strategies to enable better decision making Apply principles of negotiation\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT 641 Syllabus.json",
    "course_code": "MGT 641",
    "course_title": "Marketing Management",
    "semester": "WN",
    "year": "",
    "text": "Course: Marketing Management (MGT 641)\n    Semester: WN \n    Credits: 3\n    Instructor: Mansoor Basha\n    Description: The study of marketing principles from the conceptual, analytical, and managerial points of view.\n    Learning Outcomes: Apply a number of strategic and tactical marketing concepts such as Segmenting, Targeting, and Positioning (STP) to real-world situations. Assess a variety of market problems and opportunities. Create a credible integrated marketing plan. Apply critical marketing tools and techniques to real cases as well as to a global marketing simulation game.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT 641WS Course Syllabus_ 2024S MGT 641-WS.json",
    "course_code": "MGT 641WS",
    "course_title": "Marketing Management",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Marketing Management (MGT 641WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Mansoor Basha\n    Description: This course provides skills to understand and create an integrated marketing plan and includes an international marketing project.\n    Learning Outcomes: Learn marketing concepts such as Segmenting, Targeting, and Positioning. Create a winning integrated marketing plan using the 4P's of marketing. Apply concepts and techniques to real cases and a global marketing simulation game.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT 663 Syllabus.json",
    "course_code": "MGT 663",
    "course_title": "Entrepreneurship",
    "semester": "Summer",
    "year": "2023",
    "text": "Course: Entrepreneurship (MGT 663)\n    Semester: Summer 2023\n    Credits: \n    Instructor: Frank Gallucci\n    Description: This course is offered for students who seek to understand the process of creating and developing business opportunities within organizations or who want to initiate and create their own venture.\n    Learning Outcomes: Contrast small business ideas from entrepreneurial business ideas by applying basic economic principles. Assess entrepreneurial business opportunities with a set of comprehensive evaluation criteria entirely and differentiate between attractive and non-attractive business opportunities. Apply frameworks to transform an entrepreneurial business idea into a complete and viable venture idea. Communicate entrepreneurial business ideas by applying basic principles of business pitch development.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT 675 Syllabus - Fall 2024.json",
    "course_code": "MGT 675",
    "course_title": "Future of Work: Implications for Leadership & Organizations",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Future of Work: Implications for Leadership & Organizations (MGT 675)\n    Semester: Fall 2024\n    Credits: 1.5\n    Instructor: Denise Rotatori\n    Description: This is a 1.5-credit course in the Stevens Institute of Technology's online Masters in Business Administration (OMBA) program, designed for scholar practitioners interested in the future of work (FoW) during this current period in history, often referred to as the fourth Industrial Revolution (4IR).\n    Learning Outcomes: Gain a common understanding of the disruptive technologies at play in the 4IR. Review illustrative ways in which these emerging technologies are impacting various sectors of the economy. Examine similarities and differences between the 4IR and prior periods of transformative change. Examine different philosophical orientations toward what these technologies mean for the future of work. Review the way in which these broader trends have impacted professional practice. Explore the role that leaders can play in stewarding effective workforce transitions within their organizations. Review the ethical implications and challenges due to the rise of cognitive technologies.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT 699WN Syllabus.json",
    "course_code": "MGT699",
    "course_title": "Strategic Management",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Strategic Management (MGT699)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Ann Murphy, Ph.D.\n    Description: An interdisciplinary course which examines the elements of, and the framework for, developing and implementing organizational strategy and policy in competitive environments.\n    Learning Outcomes: Formulate strategic recommendations to help firms create and sustain competitive advantage. Analyze an organization’s internal and external environments using a variety of quantitative and qualitative tools and techniques. Discriminate between tactical and strategic approaches to problems, and be able to elevate the approach to be more strategic when necessary. Generate strategic alternatives and solutions. Leverage technology in both the approach to strategic management analyses as well as in the strategic management solutions for organizations. Defend strategic analyses and recommendations in individual and group reports and presentations.\n    Prerequisites: FIN500 FIN515",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT 700 Course Syllabus_ 2024F MGT 700-A.json",
    "course_code": "MGT 700",
    "course_title": "Econometrics",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Econometrics (MGT 700)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Pallavi Pal\n    Description: Econometrics, literally “economic measurement,” is a branch of economics that attempts to quantify theoretical relationships.\n    Learning Outcomes: Understand the difference between an economic model and an econometric model Define the linear regression model based on the classical linear regression Perform ordinary least squares (OLS) estimation. Use hypothesis testing and confidence interval construction for the population parameters based on the finite sample properties of OLS estimators. Understand extensions to the linear regression model including heteroskedasticity and autocorrelation. Employ time-series regression. Understand the basic panel data methods. Be proficient in the empirical estimation of a model using statistical software.\n    Prerequisites: BT221 Statistics QF200 or Equivalent",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT506WS syllabus Summer 2024-4 (1).json",
    "course_code": "EMT506",
    "course_title": "Economics for Managers",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Economics for Managers (EMT506)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Joelle Saad-Lessler\n    Description: This course introduces managers to the essence of business economics – the theories, concepts and ideas that form the economist’s tool kit encompassing both the microeconomic and macroeconomic environments.\n    Learning Outcomes: Use supply and demand to explain various economic phenomena and principles. Explain the measurement and importance of GDP, inflation, unemployment, money, and trade. Explain the economic meaning of price, elasticity, and production costs. Describe the cause and effect of changes in all of these variables. Draw and analyze cost and revenue curves that maximize profit. Discuss differences and critically analyze the pros and cons of different market structures, including competitive, monopolistic and oligopolistic markets. Read and explain the content of economic materials from a secondary source (such as the Wall Street Journal, New York Times, etc.) Relate economic concepts to these real-world events and critically evaluate the impact of economic policy.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT506WS syllabus Summer 2024-4.json",
    "course_code": "EMT506",
    "course_title": "Economics for Managers",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Economics for Managers (EMT506)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Joelle Saad-Lessler\n    Description: This course introduces managers to the essence of business economics – the theories, concepts and ideas that form the economist’s tool kit encompassing both the microeconomic and macroeconomic environments.\n    Learning Outcomes: Use supply and demand to explain various economic phenomena and principles. Explain the measurement and importance of GDP, inflation, unemployment, money, and trade. Explain the economic meaning of price, elasticity, and production costs. Describe the cause and effect of changes in all of these variables. Draw and analyze cost and revenue curves that maximize profit. Discuss differences and critically analyze the pros and cons of different market structures, including competitive, monopolistic and oligopolistic markets. Read and explain the content of economic materials from a secondary source (such as the Wall Street Journal, New York Times, etc.) Relate economic concepts to these real-world events and critically evaluate the impact of economic policy.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Mgt619 syllabusspring 2024.json",
    "course_code": "Management 619",
    "course_title": "Leading Across Projects",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Leading Across Projects (Management 619)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Pete Dominick, Ph.D.\n    Description: This course explores executive leadership skills required in complex organizations.\n    Learning Outcomes: Making executive-level decisions in complex environments Shaping the environment and driving change Identifying and developing talent among team leaders and members\n    Prerequisites: Mgt. 612: Leader Development",
    "embedding_dim": 1536
  },
  {
    "filename": "MGT_613 Fall 2024  Syllabus Schedule.json",
    "course_code": "MGT 613",
    "course_title": "Project Portfolio Management and the Program Management Office",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Project Portfolio Management and the Program Management Office (MGT 613)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dr. Alan C. Maltz, P.E.\n    Description: MGT 613 covers the concepts of Project Portfolio Management (PPM) and the Program Management Office (PMO). The course discusses a framework of PPM, including portfolio planning, monitoring and control. Tools and techniques of PPM are discussed. The course also addresses different types of PMO including their functions. Steps for implementing PPM and PMO in an organization are also covered. Case studies are used throughout the course to help students gain a better understanding of the material.\n    Learning Outcomes: Introduce a strategic, system perspective of organizational project management. Discuss a framework of project portfolio management. Practice applying tools and techniques used in project portfolio management. Discuss different types and functions of program management offices.\n    Prerequisites: MGT 609 MGT 610",
    "embedding_dim": 1536
  },
  {
    "filename": "MIS 636 Syllabus_Fall23-1.json",
    "course_code": "MIS 636",
    "course_title": "Data Integration for Business Intelligence",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Data Integration for Business Intelligence (MIS 636)\n    Semester: Fall 2023\n    Credits: 3.0\n    Instructor: Chris Asakiewicz, PhD\n    Description: This course will focus on the design, management, and use of data warehouse (DW) and business intelligence (BI) systems.\n    Learning Outcomes: Perform the functions of a data architect in industry as evidenced through lab assignments and the final project. Assess business information needs and apply appropriate data-oriented technology solutions. Design a business intelligence system. Apply the data warehouse life cycle in the development of a business intelligence system. Develop conceptual data models. Leverage commercial tools (Erwin, MongoDB, and Alteryx) for business intelligence and data integration. Build dashboards and visualizations for business intelligence.\n    Prerequisites: Students must satisfy the requirements for enrollment in either the BI&A or MIS master’s degree programs.",
    "embedding_dim": 1536
  },
  {
    "filename": "MIS 636 Syllabus_Spring 23-1.json",
    "course_code": "MIS 636",
    "course_title": "Data Integration for Business Intelligence",
    "semester": "Spring",
    "year": "2023",
    "text": "Course: Data Integration for Business Intelligence (MIS 636)\n    Semester: Spring 2023\n    Credits: 3.0\n    Instructor: Chris Asakiewicz, PhD\n    Description: This course will focus on the design, management, and use of data warehouse (DW) and business intelligence (BI) systems.\n    Learning Outcomes: Perform the functions of a data architect in industry as evidenced through lab assignments and the final project. Assess business information needs and apply appropriate data-oriented technology solutions. Design a business intelligence system. Apply the data warehouse life cycle in the development of a business intelligence system. Develop conceptual data models. Leverage commercial tools (Erwin, MongoDB, and Alteryx) for business intelligence and data integration. Build dashboards and visualizations for business intelligence.\n    Prerequisites: Students must satisfy the requirements for enrollment in either the BI&A or MIS master’s degree programs.",
    "embedding_dim": 1536
  },
  {
    "filename": "MIS 730syllabus2024fall_online_v3.json",
    "course_code": "MIS 730",
    "course_title": "Integrating IS Technologies",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Integrating IS Technologies (MIS 730)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Jeffrey Nickerson\n    Description: This course focuses on ways of designing and integrating information systems architectures.\n    Learning Outcomes: By the end of this course, students will be able to formulate a series of plausible alternative designs for integrating technologies. Students will know the different components of IS architectures, how they work, and how they integrate with each other. Students will improve their ability to communicate about design in group and presentation settings.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MIS-637 Course Syllabus-1.json",
    "course_code": "MIS-637",
    "course_title": "Data Analytics and Machine Learning",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Data Analytics and Machine Learning (MIS-637)\n    Semester: Summer 2024\n    Credits: 3\n    Instructor: Dr. Foad Mahdavi Pajouh\n    Description: This course will focus on Data Mining & Knowledge Discovery Algorithms and their applications in solving real world business and operation problems.\n    Learning Outcomes: Formulate the objectives of Knowledge Discovery using Data Analytics and Machine Learning algorithms, and identify profound questions to be answered. Identify relevant data and corresponding databases, data warehouses, and data sources from which Knowledge can be extracted. Preprocess the data (Clean, Integrate, and Transform). Determine proper algorithms, discovery models, and technologies to use for Knowledge Discovery. Execute and discover patterns and dependencies to make predictions. Extract and apply Nuggets of knowledge to make intelligent scientific, business, and operations decisions. Present and document results. Input the extracted knowledge to the next iterative step.\n    Prerequisites: Students are expected to be familiar with calculus, elementary probability & statistics.",
    "embedding_dim": 1536
  },
  {
    "filename": "MIS-699 WS -Fall-2024-Syllabus.json",
    "course_code": "MIS 699A",
    "course_title": "Digital Innovation",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Digital Innovation (MIS 699A)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dr. Cherif Amirat\n    Description: This course focuses on how organizations can effectively and efficiently assess trends and emerging technologies in data and knowledge management, information networks, and analyzing and developing application systems.\n    Learning Outcomes: Students will learn and, in teams, research and create presentations on emerging technologies, new business models and methodologies. Students will be able to separate the “hype” of new technology from the underlying business opportunities and technical challenges. Students will be assigned a current emerging technology to research and provide a “technology briefing” presentation for the class. Students will be able to identify the requirements for a specific information system and express these requirements in a form usable by Information Technology professionals. Students will be able to apply the concepts learned during the lectures and cases in their final project. Students will be able to determine the advantages and disadvantages of different technologies, information systems and business structures for a specific application.\n    Prerequisites: MIS710 MIS630 FIN615",
    "embedding_dim": 1536
  },
  {
    "filename": "MIS760_Fall2024_Online_syllabus.json",
    "course_code": "MIS 760",
    "course_title": "IT Strategy",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: IT Strategy (MIS 760)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Katia Meggiorin\n    Description: This course addresses the strategic responsibilities and roles of the CIO and IT managers.\n    Learning Outcomes: Develop an IT strategy that aligns with the business Understand the current issues facing the IT organization and have tools to address them Apply how IT can deliver value Explain the changing role of the CIO Understand how IT can develop a partnership with the business Discuss some of the ways technology is being used to transform organizations Understand how IT can drive business improvement and a competitive advantage\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "MT,ME-518WS-24S Syllabus.json",
    "course_code": "ME/MT-518WS",
    "course_title": "Solar Energy, Theory & Application",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Solar Energy, Theory & Application (ME/MT-518WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Charles Cohn\n    Description: The course is intended for students who have interest in alternate energy sources as a contributor to sustainability. It provides a comprehensive treatise on the science and technology of solar energy, its collection and the design principles that need to be understood for its effective use in a variety of installations and uses.\n    Learning Outcomes: Understand the factors that influence the use of solar radiation as an energy source. Know the various active and passive technologies that are available for collecting solar energy. Have the ability to apply design principles to selection of an appropriate solar energy installation to meet requirements.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Narcyz Roztocki FIN 515 WS Fall 2024 Syllabus.json",
    "course_code": "FIN 515 WS/WS1",
    "course_title": "Financial Decision Making",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Financial Decision Making (FIN 515 WS/WS1)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Narcyz Roztocki, Ph.D.\n    Description: FIN 515 provides the requisite survey of financial accounting, managerial accounting, and corporate finance topics.\n    Learning Outcomes: Describe and contrast the information needs of external stakeholders and management. Apply steps in the financial reporting process and prepare financial statements. Gain an understanding of some commonly used financial statement metrics. Characterize, calculate, and assign costs with particular emphasis on manufacturing overhead costs. Prepare budgets using provided estimates and assumptions, compare actual results to budgeted expectations, and evaluate differences and performance. Explain and apply the time value of money concepts. Understand the valuation of stocks. Evaluate capital investments.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Narcyz Roztocki FIN 615 WS Fall 2021 Syllabus.json",
    "course_code": "FIN 615 WS",
    "course_title": "Financial Decision Making",
    "semester": "Fall",
    "year": "2021",
    "text": "Course: Financial Decision Making (FIN 615 WS)\n    Semester: Fall 2021\n    Credits: \n    Instructor: Narcyz Roztocki, Ph.D.\n    Description: This course introduces students to the principles of accounting and finance.\n    Learning Outcomes: Apply accounting and financial principles supplemented with financial ratio analysis techniques to analyze the operational results of a firm over time and relative to competitive and market benchmarks. Analyze cost behavior and evaluate operational outcomes reported by different costing systems. Use accounting information and apply financial principles to make better investment and resource allocation decisions. Appreciate how operating efficiency, investment effectiveness and financial structure increase firm value and maximize investment returns to shareholders.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Operations Management MGT 657-online-Syllabus-3.json",
    "course_code": "MGT 657",
    "course_title": "Operations Management",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Operations Management (MGT 657)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Foad Mahdavi Pajouh, Ph.D.\n    Description: Introduces the student to the concepts and techniques used by organizations to support their fundamental task of producing goods and services.\n    Learning Outcomes: Explain how the production and operations function is managed and how it interfaces with other key business functions. Prescribe the tools and analytical techniques used by managers to improve operations and to aid decision-making. Facilitate the various demand forecasting techniques. Incorporate the concepts of quality management into the enterprise’s operations. Explain the core concepts of supply chain management, the goals of a supply chain, the impact of supply chain decisions on the success of a company, and key decision areas. Develop models for making network design decisions and use optimization methods for facility location and network design decisions. Cultivate the details of capacity planning, facility planning, locating, layout and design. Handle the facets of production planning, scheduling and inventory control systems.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Operations Management MGT 657-online-Syllabus.json",
    "course_code": "MGT 657",
    "course_title": "Operations Management",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Operations Management (MGT 657)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Foad Mahdavi Pajouh, Ph.D.\n    Description: Introduces the student to the concepts and techniques used by organizations to support their fundamental task of producing goods and services.\n    Learning Outcomes: Understand how the production and operations function is managed and how it interacts with other key business functions. Understand core concepts of supply chain management, discuss the goals of a supply chain, explain the impact of supply chain decisions on the success of a company, and identify key decision areas. Comprehend and evaluate the details of capacity planning, facility planning, locating, layout and design. Learn and select the tools and analytical techniques used by managers to improve operations and to aid decision-making. Incorporate the concepts of quality management into the enterprise’s operations. Examine and specify various demand forecasting techniques. Understand the aspects of production planning and inventory control systems. Mine procurement and vendor data, perform spend analysis and make sourcing decisions. Develop models for making network design decisions and use optimization methods for facility location and network design decisions. Use decision tree methodologies to evaluate supply chain planning and capacity allocation decisions under uncertainty.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "PME 542A  Syllabus Summer 2024.json",
    "course_code": "PME 542",
    "course_title": "Global Regulation and Compliance in the Life Science Industry",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Global Regulation and Compliance in the Life Science Industry (PME 542)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Professor Marc Bernhardt\n    Description: This course explores the economic theory of regulation in general, and the US and international regulatory environments that govern the pharmaceutical, medical device and biotechnology industries.\n    Learning Outcomes: To demonstrate an understanding of the economic theory of regulation To determine the requirements and role of US and international regulation for a pharmaceutical, medical device, or biotech company to operate successfully in a global environment. To assess the role of ethics in life sciences regulation and compliance, and to demonstrate the process of making ethical decisions. To effectively communicate the results of assignments and research about life sciences regulation and compliance in written reports\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "PME 560WS 2023 Introduction & Syllabus Updated 19Aug.json",
    "course_code": "PME 560",
    "course_title": "Quality in Life Sciences Manufacturing",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Quality in Life Sciences Manufacturing (PME 560)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Sam Spagnuolo\n    Description: This is a required course in the Pharmaceutical Manufacturing and Engineering Program. It can be taken by students pursuing a Graduate Certificate in Validation, Compliance and Quality, or a Master’s Degree in Pharmaceutical Manufacturing.\n    Learning Outcomes: To describe various life sciences quality system models To demonstrate a variety of quality tools and to explain their use in life sciences industry investigations and assessments To discuss various quality roles in life science industries and how they contribute to the overall quality of the industry To effectively communicate the results of assignments and research about quality in life science manufacturing in written reports\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "PME 628WS F21 Syllabus.json",
    "course_code": "PME 628",
    "course_title": "Manufacturing & Packaging of Pharmaceutical OSD Products",
    "semester": "Fall",
    "year": "2021",
    "text": "Course: Manufacturing & Packaging of Pharmaceutical OSD Products (PME 628)\n    Semester: Fall 2021\n    Credits: \n    Instructor: Professor Elaine Lehecka Pratt\n    Description: This is an elective course in the Pharmaceutical Manufacturing and Engineering Program. It can be taken by students pursuing a Graduate Certificate in Pharmaceutical Manufacturing, or a Master’s Degree in Pharmaceutical Manufacturing.\n    Learning Outcomes: To demonstrate familiarity with the technologies, unit operations and GMP requirements for the manufacturing and packaging of OSD pharmaceutical products To analyze and evaluate manufacturing and packaging processes for most common OSD products To review and assess facility and process equipment requirements for OSD manufacturing and packaging To understand and explain process validation and quality testing for OSD products\n    Prerequisites: PME/CHE/ME 530",
    "embedding_dim": 1536
  },
  {
    "filename": "provsylversionSpring2024.json",
    "course_code": "",
    "course_title": "DevOps Principles and Practices",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: DevOps Principles and Practices ()\n    Semester: Spring 2024\n    Credits: \n    Instructor: Gregg Vesonder\n    Description: This course introduces students to the Software Engineering principles and practices of DevOps.\n    Learning Outcomes: Name and describe the Three Ways: Flow, Feedback, and Continual Learning and Experimental and explain why they are important for successful DevOps teams Summarize the strengths and weaknesses of Cloud architectures and technology Apply tools to create an automated pipeline from software change through automated tests, continuous integration, and deployment. Identify the culture, principles, tools, and practices used by successful DevOps teams to deliver high quality functionality to customers Describe the needs of deployment and maintenance of software products beyond the development phase of a software project Summarize alternative software development lifecycles Apply Software Engineering life cycle principles to development projects\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SS2024 CM592 Advanced Controls for the Built Environment.json",
    "course_code": "CM592A-WS",
    "course_title": "Advanced Project Controls for the Built Environment",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Advanced Project Controls for the Built Environment (CM592A-WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Karim S. Karam\n    Description: This course is aimed at providing students with theory, methods and quantitative tools to effectively plan, and construct infrastructure projects.\n    Learning Outcomes: Understand the construction project life-cycle Evaluate projects Understand project organizational structures, and project delivery methods Produce a Construction Management Plan Define project controls, and establish project monitoring systems\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SSW 555 Syllabus-2.json",
    "course_code": "CS 555",
    "course_title": "CS 555 Agile Methods for Software Development",
    "semester": "",
    "year": "",
    "text": "Course: CS 555 Agile Methods for Software Development (CS 555)\n    Semester:  \n    Credits: \n    Instructor: Dr. Richard Ens\n    Description: This course examines agile methods, including Extreme Programming (XP), Scrum, Lean, Crystal, Dynamic Systems Development Method and Feature-Driven Development to understand how rapid realization of software occurs most effectively.\n    Learning Outcomes: Compare and contrast several agile methods for software development. Compare and contrast the origins and motivations of the Agile Manifesto vs. historical methodologies. Refactor code and tests to meet changing needs. Develop and monitor project backlogs. Measure and monitor velocity of development. Compare and contrast plan-driven versus agile methods.\n    Prerequisites: Programming experience in an object-oriented language, preferably Java or Python",
    "embedding_dim": 1536
  },
  {
    "filename": "SSW 564 A Fall 2022 Syllabus_ 2024F SSW 564-WS.json",
    "course_code": "SSW 564 A",
    "course_title": "Software Requirements Analysis and Engineering",
    "semester": "Fall",
    "year": "2022",
    "text": "Course: Software Requirements Analysis and Engineering (SSW 564 A)\n    Semester: Fall 2022\n    Credits: \n    Instructor: Prof. Sanjay Macwan\n    Description: Requirements engineering is one of the least understood and hardest phases in the development of software products.\n    Learning Outcomes: Understand appropriate methods to elicit requirements from stakeholders Know how to distinguish and describe functional and non-functional requirements in formal and non-formal notations Understand how software requirements fit into the software lifecycle and influences other sub-processes. Learn how to distinguish good requirements from bad requirements Learn how to write and evaluate unambiguous requirements.\n    Prerequisites: Some familiarity with software development is expected for this course.",
    "embedding_dim": 1536
  },
  {
    "filename": "SSW533 Fall 2024 Schedule.json",
    "course_code": "",
    "course_title": "",
    "semester": "Fall",
    "year": "2024",
    "text": "Course:  ()\n    Semester: Fall 2024\n    Credits: \n    Instructor: \n    Description: \n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Stevens MGT 663 Syllabus Fall 2024.json",
    "course_code": "MGT 663-WS",
    "course_title": "Discovering and Exploiting Entrepreneurial Opportunities",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Discovering and Exploiting Entrepreneurial Opportunities (MGT 663-WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Frank Gallucci and Dr. Andres Jimenez, MD, MSED, MBA, MS\n    Description: In this course, students will evaluate and create their own perspectives on business strategies. They will develop an understanding of entrepreneurship and innovation in starting and growing a business venture.\n    Learning Outcomes: Differentiate between small business ideas and entrepreneurial business ideas. Critically evaluate entrepreneurial business ideas. Create complete business ideas. Develop winning business models. Effectively present entrepreneurial business ideas.\n    Prerequisites: FIN 523 Financial Management FIN 500 Financial and Managerial Accounting MGT 506 Economics for Managers",
    "embedding_dim": 1536
  },
  {
    "filename": "Stevens Syllabus for Online Course CPE555WS_Fall_2023.json",
    "course_code": "CPE555WS",
    "course_title": "Real-Time and Embedded Systems",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Real-Time and Embedded Systems (CPE555WS)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Dr. Jack Winters\n    Description: This course is a survey of many topics of interest to designers of real-time and embedded systems.\n    Learning Outcomes: Define what real-time embedded systems are, and give examples of each Describe the difference between hard- and soft-real-time systems Describe the size, weight, and power requirements that constrain embedded systems Describe the differences between Harvard and Von Neumann machines and their benefits Describe how pipelining is used to improve processor performance List the types of memory devices used in embedded systems, and explain the benefits and drawbacks of each Describe the principles behind caching and the associated performance improvements Describe what purposes interrupts and timers serve in embedded system designs Determine what hardware interfaces should be used for different devices commonly used in modern embedded systems Describe common issues related to concurrent/multi-threaded programming and how to resolve them Develop simple multi-threaded applications in C Use common features of real-time embedded operating systems and develop simple applications in FreeRTOS Describe various scheduling algorithms used in real-time systems and analyze the feasibility of different schedules\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Stevens Syllabus Online FE610WS.json",
    "course_code": "FE 610",
    "course_title": "Stochastic Calculus for Finance",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Stochastic Calculus for Finance (FE 610)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Thomas Lonon\n    Description: This course is designed for advanced undergraduate students and masters students in Financial Engineering.\n    Learning Outcomes: Classify stochastic processes as martingales, Markov, or both/neither Simplify stochastic (Ito) integrals Determine the differentials of functions of stochastic processes Change probability measures to facilitate pricing of derivatives Solve stochastic differential equations through transformations to partial differential equations.\n    Prerequisites: Knowledge of Calculus and Probability",
    "embedding_dim": 1536
  },
  {
    "filename": "Stevens Syllabus SSW 565_Spring2024.json",
    "course_code": "SSW565",
    "course_title": "Software Architecture and Component Based Design",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Software Architecture and Component Based Design (SSW565)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Ying Wang\n    Description: This course provides the student with a working knowledge of the terms, principles and methods of Software Architecture and Component-Based Design.\n    Learning Outcomes: Construct an architecture using the '4+1' model, emphasizing architectural styles and nonfunctional requirements Base software design on components, patterns and classes using a domain driven approach Re-factor code to improve understanding or modification Apply a continuous learning approach to software architecture and design\n    Prerequisites: SSW 540 or equivalent experience",
    "embedding_dim": 1536
  },
  {
    "filename": "Stevens Syllabus SSW 565_WS_Fall2024.json",
    "course_code": "SSW565",
    "course_title": "Software Architecture and Component Based Design",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Software Architecture and Component Based Design (SSW565)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Ying Wang\n    Description: This course provides the student with a working knowledge of the terms, principles and methods of Software Architecture and Component-Based Design.\n    Learning Outcomes: Construct an architecture using the '4+1' model, emphasizing architectural styles and nonfunctional requirements Base software design on components, patterns and classes using a domain driven approach Re-factor code to improve understanding or modification Apply a continuous learning approach to software architecture and design\n    Prerequisites: SSW 540 or equivalent experience",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus - 2024S CPE695-WS_.json",
    "course_code": "AAI/CPE/EE 695-WS",
    "course_title": "Applied Machine Learning",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Applied Machine Learning (AAI/CPE/EE 695-WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Elijah Bolluyt\n    Description: An introductory course for machine learning theory, algorithms, and applications.\n    Learning Outcomes: Demonstrate basic principles and algorithms of representative machine learning systems including supervised learning, unsupervised learning, batch learning, online learning, model-based learning, and instance-based learning. Determine appropriate machine learning algorithms for real-world tasks. Evaluate the performance of a machine learning system with appropriate performance measurement metrics. Apply appropriate training, evaluation, and parameter tuning techniques to improve machine learning algorithms. Develop a machine learning system with programming languages such as Python. Create interactive documentation with program codes and rich texts. Write a comprehensive report to communicate the main ideas, techniques, and findings of a machine learning project.\n    Prerequisites: Basic probability and statistics Familiarity with Python language",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus - BIA 678 - Spring 2024.json",
    "course_code": "BIA 678 WS",
    "course_title": "Big Data Technologies",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Big Data Technologies (BIA 678 WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Prof. Venu Guntupalli\n    Description: \n    Learning Outcomes: Understand what Big Data is, and how it differs from traditional approaches to BI&A Understand tools associated with Big Data in creating scalable systems to take advantage of big data Gain hands-on experience using popular tools, frameworks and technology stacks associated with Big Data Extract knowledge and intelligence from datasets which exhibit high volume, velocity, and/or variety Understand and execute analyses oriented to batch & streaming data using classic and latest modeling approaches Plan and execute a project that includes the use of at least one Big Data dataset on distributed compute and storage on cloud Understand and discuss the meta issues around Big Data, such as governance, security, and privacy\n    Prerequisites: Familiarity and experience in areas such as Multivariate statistics, Data mining, Databases, and Programming Familiarity and hands-on experience with Python and SQL",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus - CPE-EE-AAI-695WS (1).json",
    "course_code": "CPE/EE/AAI 695WS",
    "course_title": "Applied Machine Learning",
    "semester": "Summer",
    "year": "2023",
    "text": "Course: Applied Machine Learning (CPE/EE/AAI 695WS)\n    Semester: Summer 2023\n    Credits: \n    Instructor: Shucheng Yu\n    Description: An introductory course for machine learning theory, algorithms, and applications.\n    Learning Outcomes: Demonstrate basic principles and algorithms of representative machine learning systems including supervised learning, unsupervised learning, batch learning, online learning, model-based learning, and instance-based learning. Determine appropriate machine learning algorithms for real-world tasks. Evaluate the performance of a machine learning system with appropriate performance measurement metrics. Apply appropriate training, evaluation, and parameter tuning techniques to improve machine learning algorithms. Develop a machine learning system with programming languages such as Python. Create interactive documentation with program codes and rich texts. Write a comprehensive report to communicate the main ideas, techniques, and findings of a machine learning project.\n    Prerequisites: Basic probability and statistics Familiarity with Python language",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus - CPE-EE-AAI-695WS.json",
    "course_code": "CPE/EE/AAI 695WS",
    "course_title": "Applied Machine Learning",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Applied Machine Learning (CPE/EE/AAI 695WS)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Shucheng Yu\n    Description: An introductory course for machine learning theory, algorithms, and applications.\n    Learning Outcomes: Demonstrate basic principles and algorithms of representative machine learning systems including supervised learning, unsupervised learning, batch learning, online learning, model-based learning, and instance-based learning. Determine appropriate machine learning algorithms for real-world tasks. Evaluate the performance of a machine learning system with appropriate performance measurement metrics. Apply appropriate training, evaluation, and parameter tuning techniques to improve machine learning algorithms. Develop a machine learning system with programming languages such as Python. Create interactive documentation with program codes and rich texts. Write a comprehensive report to communicate the main ideas, techniques, and findings of a machine learning project.\n    Prerequisites: Basic probability and statistics Familiarity with Python programming",
    "embedding_dim": 1536
  },
  {
    "filename": "syllabus - FE535WS.json",
    "course_code": "FE535",
    "course_title": "Introduction to Financial Risk Management",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Introduction to Financial Risk Management (FE535)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Anthony Diaco\n    Description: The course will review different topics related to risk modeling and management, specifically in line with Financial Risk Manager (FRM) Parts I and II (mainly Part I).\n    Learning Outcomes: model risk using stochastic processes use statistical analysis of financial data for risk pricing and management understand different types of asset classes and derivatives identify different types of risk such as model, market, and credit apply derivatives for linear and non-linear risk management\n    Prerequisites: A quantitative background is assumed, i.e. knowledge of probability, statistics, and calculus. Knowledge in programming would be extremely helpful.",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus Fall 2023 Web_PME 530.json",
    "course_code": "PME 530",
    "course_title": "Introduction to Pharmaceutical Manufacturing",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Introduction to Pharmaceutical Manufacturing (PME 530)\n    Semester: Fall 2023\n    Credits: \n    Instructor: \n    Description: The course covers an introduction to the pharmaceutical industry.\n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus Fall 2023_ 2023F SSW 567-A.json",
    "course_code": "SSW 567",
    "course_title": "Software Testing, Quality, and Maintenance",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Software Testing, Quality, and Maintenance (SSW 567)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Dr. Eman AlOmar\n    Description: This course is an in-depth study of software testing and quality throughout the development process.\n    Learning Outcomes: Develop effective test plans and test strategies throughout the system lifecycle Select best fit test case design methodologies Prevent system defects and failures through appropriate early defect removal techniques such as requirements reviews, code reviews and integration test Design and implement tests and measure the results Measure the progress of the testing process Manage configurations and trouble reports Project the expected reliability and quality of a release Understand and test for limited security vulnerabilities Understand and use (limited) automated testing tools Demonstrate critical thinking by reviewing and critiquing current topics in the field Understand how software testing fits into the continuous integration and continuous delivery pipeline Practice learning through lab exercises & team work\n    Prerequisites: Good working knowledge of Python",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus Fall 2024_ 2024F SSW 567-WS.json",
    "course_code": "SSW 567",
    "course_title": "Software Testing, Quality, and Maintenance",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Software Testing, Quality, and Maintenance (SSW 567)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dr. Eman AlOmar\n    Description: This course is an in-depth study of software testing and quality throughout the development process.\n    Learning Outcomes: Develop effective test plans and test strategies throughout the system lifecycle Select best fit test case design methodologies Prevent system defects and failures through appropriate early defect removal techniques such requirements reviews, code reviews and integration test Design and implement tests and measure the results Measure the progress of the testing process Manage configurations and trouble reports Project the expected reliability and quality of a release Understand and test for limited security vulnerabilities Understand and use (limited) automated testing tools Demonstrate critical thinking by reviewing and critiquing current topics in the field Understand how software testing fits into the continuous integration and continuous delivery pipeline Practice learning through lab exercises & team work\n    Prerequisites: Good working knowledge of Python",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for 2022F FA 550-WS1.json",
    "course_code": "FA550",
    "course_title": "Data Visualization Applications",
    "semester": "Fall",
    "year": "2022",
    "text": "Course: Data Visualization Applications (FA550)\n    Semester: Fall 2022\n    Credits: \n    Instructor: Brian Moriarty\n    Description: Effective visualization of complex data allows for useful insights, more effective communication, and making decisions. This course investigates methods for visualizing datasets from a variety of perspectives in order to best identify the best solution for a given task.\n    Learning Outcomes: Develop knowledge of tools for visualizing datasets Develop a programmatic understanding of translating data into useful visual forms Develop a critical vocabulary to engage and discuss information visualization Develop an understanding of data visualization theory Understanding of ethical considerations for data visualization\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for 2023S MIS 714-WZ.json",
    "course_code": "MIS 714",
    "course_title": "Service Innovation",
    "semester": "Spring",
    "year": "2023",
    "text": "Course: Service Innovation (MIS 714)\n    Semester: Spring 2023\n    Credits: \n    Instructor: Prof. Michael zur Muehlen\n    Description: This course leads students through the identification, analysis, definition, and deployment of service opportunities within public and private organizations.\n    Learning Outcomes: Understand the principles of good service design Understand the concept of Customer Variability Document the processes, rules, customer journey, and case management aspects of a service Develop a Customer Journey Map across multiple related service tasks Evaluate the quality of a given service offering Develop a plan to improve a service offering Design a new service offering from scratch\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for 2024A FIN 523-WZ.json",
    "course_code": "FIN 523 WZ",
    "course_title": "Financial Management",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Financial Management (FIN 523 WZ)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Prof Kal Vadasz, Prof Igor Gavrilov\n    Description: The purpose of this course is to introduce techniques of financial analysis, with emphasis on topics in the corporate finance area.\n    Learning Outcomes: Understand the role of Managerial Finance in the business enterprise Apply the concept of time value of money to evaluate equity and fixed income securities. Understand the legal and market fundamentals of stocks and bonds. Understand the difference between debt and equity capital, common and preferred stock, and approaches to common stock valuation. Develop plans to frame long-term investment decisions that include applying free cash flow analysis, capital budgeting techniques, decision metrics (NPV, EVA, breakeven, IRR, etc.), and risk assessment. Determine the cost of capital and understand its significance in making long-term investment decisions. Calculate leverage and understand optimal firm capital structure theories. Have a basic awareness of how derivatives can serve to reduce risk.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for 2024F EM 622-WS.json",
    "course_code": "EM 622",
    "course_title": "Data Visualization and Data Manipulation",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Data Visualization and Data Manipulation (EM 622)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dr. Jose E. Ramirez-Marquez\n    Description: This course provides an introduction to data visualization and data manipulation.\n    Learning Outcomes: Apply a framework for conducting data exploration analysis Manipulate data to fit their needs Create high quality plots to understand phenomena\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for 2024F EM 623-CA.json",
    "course_code": "EM/SYS 623",
    "course_title": "Data Science and Knowledge Discovery",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Data Science and Knowledge Discovery (EM/SYS 623)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dr. Feng Liu\n    Description: This course provides an introduction to data mining and pattern recognition.\n    Learning Outcomes: Provide students with a sound basis in data mining and pattern recognition tasks and techniques. Ensure that students are able to read, and critically evaluate data mining and analytics research papers. Ensure that students are able to implement and to use important data mining and pattern recognition models and algorithms and to solve interdisciplinary problems for data-driven decision-making problems in engineering and sciences.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for 2024F FIN 550-WS.json",
    "course_code": "FIN 550-WS",
    "course_title": "Financial Planning",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Financial Planning (FIN 550-WS)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dr. Vasileios Katsikiotis\n    Description: This course will review the fundamental principles of financial planning, professional conduct, education planning, risk management and regulation.\n    Learning Outcomes: Understand the fundamental concepts of financial planning from a theoretical and applied perspective. Understanding and apply the code of ethics and professional responsibility, rules of conduct, planning standards and disciplinary rules (including related procedures) applicable to certified financial planning along with the fiduciary standards to which planners must conform. Understand consumer financial laws that apply to financial planning products and processes Apply the basic concepts of time value of money, portfolio selection and optimization to problems related to financial planning and risk management. Know the value and also the limits of financial planning and risk management at a personal level. Understand different insurance products that can be used to hedge the risk of financial plans.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for 2024F MGT 635-WS.json",
    "course_code": "MGT 635",
    "course_title": "",
    "semester": "Fall",
    "year": "2023",
    "text": "Course:  (MGT 635)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Professors Frank & Magnone\n    Description: \n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for 2024S EE 575-WS.json",
    "course_code": "EE 575",
    "course_title": "Introduction to Control Theory",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Introduction to Control Theory (EE 575)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Goran Djuknic, PhD\n    Description: An introduction to the classic and modern control theories with emphasis on state space modeling and feedback control.\n    Learning Outcomes: \n    Prerequisites: EE 348 System Theory or equivalent",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for 2024S FA 590-WS.json",
    "course_code": "FE 590",
    "course_title": "Statistical Machine Learning In Finance",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Statistical Machine Learning In Finance (FE 590)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Prof. Kosrow Dehnad\n    Description: \n    Learning Outcomes: \n    Prerequisites: Knowledge of R or Python (or willingness to learn) Prob/Stat background",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for 2024S ME 621-WS.json",
    "course_code": "ME 621-WS",
    "course_title": "Introduction to Modern Control Engineering",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Introduction to Modern Control Engineering (ME 621-WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Long Wang\n    Description: This course is a self-contained graduate level introduction to linear feedback control systems.\n    Learning Outcomes: Describe a system using mathematical representations of state-space and transfer functions Design a state-feedback control system using state-space based and frequency-domain based approaches Analyze the performance of state-feedback and classical control systems Analyze and communicate findings from seminal papers to support further studies in the field of control\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus for FIN-500-WS Financial and Managerial Accounting Spring 2024 Online.json",
    "course_code": "FIN-500",
    "course_title": "Financial and Managerial Accounting",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Financial and Managerial Accounting (FIN-500)\n    Semester: Spring 2024\n    Credits: \n    Instructor: James B. Biagi, JD, CPA\n    Description: This course will provide the student with the principles and techniques of financial and managerial accounting for technical organizations.\n    Learning Outcomes: Critically analyze financial statements, with a full appreciation of the inherent limitations of reported financial information. Utilize ratio and trend analyses to evaluate the condition and performance of business entities. Apply the concepts of present value analysis to valuing assets and making appropriate business decisions. Create realistic departmental/corporate budgets. Obtain and utilize financial data to make effective business decisions, including make/buy, capital investment, product introduction timing, etc. Utilize cost accounting data to support operating decisions and cost reduction efforts.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus MGT 676_ Future of Work 2024.json",
    "course_code": "MGT 676",
    "course_title": "Future of Work: Implications for Leadership Communications",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Future of Work: Implications for Leadership Communications (MGT 676)\n    Semester: Fall 2024\n    Credits: 1.5\n    Instructor: Steven Gogel\n    Description: This is a 1.5-credit course in the Stevens Institute of Technology's online Masters in Business Administration (OMBA) program, designed for scholar practitioners interested in the future of work (FoW) during this current period in history, often referred to as the fourth Industrial Revolution (4IR).\n    Learning Outcomes: Analyze the importance of different communication strategies for effective leadership. Apply communication strategies (including active listening) to foster collaboration and engagement in the context of evolving digital platforms. Create strategies to navigate multi-perspective conversations, thinking critically on topics such as digital transformation and sustainability, to drive innovative solutions. Design a framework for future-focused feedback for fostering quality improvement, collaboration, and innovation in the 4th Industrial Revolution.\n    Prerequisites: MGT 675 (Future of Work: Implications for Leadership & Organizations) MGT 612 (Leader Development)",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus MGT611 Web8-1a.json",
    "course_code": "MGT 611",
    "course_title": "Project Analytics",
    "semester": "",
    "year": "",
    "text": "Course: Project Analytics (MGT 611)\n    Semester:  \n    Credits: \n    Instructor: Tal Ben-Zvi\n    Description: This course is designed to deepen the student’s ability to use various project management tools for planning, controlling and monitoring a project.\n    Learning Outcomes: Build project portfolio selection models. Identify and analyze project risks and develop contingency plans for those risks. Analyze the impact of variability in project tasks and plans. Choose the most appropriate resources to maintain the schedule and budget of a project. Apply quantitative measures of project progress.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus MIS 631-C-WS Managing Data Fall 2023.json",
    "course_code": "MIS631",
    "course_title": "Data Management",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Data Management (MIS631)\n    Semester: Fall 2023\n    Credits: 2 credits\n    Instructor: Elizabeth Gomez\n    Description: This 2-credit course focuses on data and database management, with an emphasis on modeling and design, and their application to business decision making. The course provides a conceptual understanding of both organizational and technical issues associated with data. The central theme concerns data modeling and databases. We examine organizational approaches to managing and integrating data. Among the topics included are normalization, entity-relationship modeling, relational database design, SQL, and data definition language (DDL). Discussed are specific applications such as strategic data management, master data management, and physical database design. The course concludes with a brief overview of Decision Support Systems, data warehousing and business intelligence, NoSQL databases (e.g., MongoDB) and cloud computing. The course includes several case studies and modeling and design projects.\n    Learning Outcomes: Understand the role of data in the competitiveness and strategy of organizations Design relational databases in normalized form Build SQL queries Develop and critique entity-relationship (ER) data models Elucidate advanced data modeling issues e.g., temporal data modeling, meta-data, etc. Identify and analyze data quality in a business context Develop and evaluate strategic data plans; e.g., Master data management plan, enterprise data strategy & models Understand the growing importance and issues associated with data warehousing, business intelligence and analytics, and big data.\n    Prerequisites: Students must satisfy the requirement for enrollment in either the BI&A or MIS master’s degree programs.",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus MIS 632-ws.json",
    "course_code": "MIS 632",
    "course_title": "Data Management LAB",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Data Management LAB (MIS 632)\n    Semester: Fall 2024\n    Credits: 1 credit\n    Instructor: Yangyang Yu\n    Description: This 1-credit lab course provides an experiential learning component for MIS 631 Data Management for which it is a co-requisite. MIS 632 provides hands-on experience in designing, implementing, and querying databases.\n    Learning Outcomes: Understand the major phases of the data life-cycle (analysis of business needs, design, implementation and use) Develop conceptual data models (E-R diagrams to design relational databases) Implement a database in PostgreSQL Build SQL queries Work in a team to execute a database development project.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus PME535WS Fall 21.json",
    "course_code": "PME 535WS",
    "course_title": "Good Manufacturing Practice in Pharmaceutical Facilities Design",
    "semester": "Fall",
    "year": "2021",
    "text": "Course: Good Manufacturing Practice in Pharmaceutical Facilities Design (PME 535WS)\n    Semester: Fall 2021\n    Credits: \n    Instructor: Leonid Shnayder\n    Description: Become familiar with current Good Manufacturing Practice (GMP) compliance in the design of pharmaceutical and biopharmaceutical facilities.\n    Learning Outcomes: Describe the special requirements related to manufacturing of drugs and how they must affect the architectural, mechanical and process design of manufacturing facilities. Assess process, mechanical and architectural design of pharmaceutical manufacturing facilities and evaluate their compliance with Good Manufacturing Practices. Select and recommend process equipment and components, architectural finishes, environmental parameters and other design features appropriate for manufacturing of pharmaceuticals. Effectively communicate results of their assignments and research about pharmaceutical manufacturing in oral presentations and in written reports.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus PME540WS Spring 23.json",
    "course_code": "PME540WS1",
    "course_title": "Validation in Life Sciences Manufacturing",
    "semester": "Spring",
    "year": "2023",
    "text": "Course: Validation in Life Sciences Manufacturing (PME540WS1)\n    Semester: Spring 2023\n    Credits: \n    Instructor: Leonid Shnayder\n    Description: Validation of a pharmaceutical manufacturing process is an essential requirement with respect to compliance with Good Manufacturing Practices (GMP).\n    Learning Outcomes: Describe the validation concepts and apply them for validation of pharmaceutical manufacturing facilities, equipment and processes. Assess process and mechanical design of pharmaceutical manufacturing facilities and evaluate their compliance with the process needs, with Good Manufacturing Practices and other applicable regulations. Select critical quality attributes of pharmaceutical products and critical process parameters that need to be controlled in order to produce quality products. Effectively communicate results of their assignments and research about pharmaceutical manufacturing in oral presentations and in written reports.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus PME602WS Spring 24.json",
    "course_code": "PME602WS",
    "course_title": "Statistical Methods in Life Science Industries",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Statistical Methods in Life Science Industries (PME602WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Leonid Shnayder\n    Description: This course is focused on the application of statistics and statistical reasoning in pharmaceutical and life science manufacturing.\n    Learning Outcomes: demonstrate familiarity with common statistical concepts analyze life science manufacturing processes using the above mentioned concepts and statistical software assess laboratory and in-process measurement methods and determine their precision and accuracy develop and evaluate sampling plans for process validation and quality control implement statistical process control methods in life science manufacturing utilize design of experiments in process development and validation\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus PME626WS Summer 22.json",
    "course_code": "PME-626WS",
    "course_title": "Manufacturing of Biopharmaceutical Products",
    "semester": "Summer",
    "year": "2022",
    "text": "Course: Manufacturing of Biopharmaceutical Products (PME-626WS)\n    Semester: Summer 2022\n    Credits: \n    Instructor: Leonid Shnayder\n    Description: This course is focused on topics related to the technology, design and operations of modern biopharmaceutical facilities.\n    Learning Outcomes: demonstrate familiarity with technologies, unit operations and GMP requirements for the manufacturing of biopharmaceutical products analyze and develop manufacturing processes for most common biopharmaceuticals formulate facility and process equipment requirements for manufacturing of biopharmaceuticals develop and implement Standard Operating Procedures and other GMP documentation for various manufacturing and support operations\n    Prerequisites: PME530 ME530 CHE530",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus SYS 625_ 2024S SYS 625-WS (1).json",
    "course_code": "SYS 625",
    "course_title": "Fundamentals of Systems Engineering",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Fundamentals of Systems Engineering (SYS 625)\n    Semester: Spring 2024\n    Credits: \n    Instructor: \n    Description: The course introduces students to the principles and processes of systems engineering.\n    Learning Outcomes: Understand the need for good systems engineering up front and throughout the life cycle of the system. Review and evaluate the various systems engineering models in use today. Differentiate between the operational need and the system solution to be implemented. Select from a wide range of system concepts as the first step in system design. Derive quantitative system requirements that best meet the functions and performance requirements of the system. Adopt a systems perspective when making decisions that affect performance or total ownership cost of the system.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus SYS 625_ 2024S SYS 625-WS.json",
    "course_code": "SYS 625",
    "course_title": "Fundamentals of Systems Engineering",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Fundamentals of Systems Engineering (SYS 625)\n    Semester: Spring 2024\n    Credits: \n    Instructor: \n    Description: The course introduces students to the principles and processes of systems engineering.\n    Learning Outcomes: Understand the need for good systems engineering up front and throughout the life cycle of the system. Review and evaluate the various systems engineering models in use today. Differentiate between the operational need and the system solution to be implemented. Select from a wide range of system concepts as the first step in system design. Derive quantitative system requirements that best meet the functions and performance requirements of the system. Adopt a systems perspective when making decisions that affect performance or total ownership cost of the system.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus SYS684.json",
    "course_code": "SYS 684",
    "course_title": "Systems Thinking",
    "semester": "",
    "year": "",
    "text": "Course: Systems Thinking (SYS 684)\n    Semester:  \n    Credits: \n    Instructor: Mo Mansouri\n    Description: Systems Thinking is an introductory course to a systemic philosophy of thinking.\n    Learning Outcomes: Understanding the concept of systemic phenomena Learning the constructing blocks of systems thinking as a paradigm and philosophy Practicing systemic tools in formulating complex problems\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus-EE-582.json",
    "course_code": "EE-582",
    "course_title": "Wireless Networking: Architectures, Protocols, and Standards",
    "semester": "",
    "year": "",
    "text": "Course: Wireless Networking: Architectures, Protocols, and Standards (EE-582)\n    Semester:  \n    Credits: \n    Instructor: Prof. Yu-Dong Yao\n    Description: This course addresses the fundamentals of wireless networking, including architectures, protocols, and standards. It describes concepts, technology and applications of wireless networking as used in current and next-generation wireless networks. It explains the engineering aspects of network functions and designs. Issues such as mobility management, wireless enterprise networks, GSM, network signaling, WAP, mobile IP, and 3/4/5G systems are covered.\n    Learning Outcomes: Student will be able to understand the relevance of mathematical principles in wireless network designs. Student will be able to identify inputs and outputs in wireless networks. Student will be able to understand the key modules in wireless networks. Student will be able to understand the design principles and methods in wireless networks. Student will be able to develop ideas for presentation by clearly outlining crucial concepts. Student will be able to follow current professional literature in various media.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus-FE543-Fall24.json",
    "course_code": "FE543",
    "course_title": "Introduction to Stochastic calculus for Finance",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Introduction to Stochastic calculus for Finance (FE543)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Prof Pape Ndiaye\n    Description: This course is designed for advanced undergraduate students and masters students in Financial Engineering. The goal is to learn the stochastic calculus foundation on which Quantitative Finance is built upon.\n    Learning Outcomes: Understand the concept of Non-arbitrage and its link to Risk-neutral Pricing Understand the basic concepts of Binomial Asset Pricing Model and its use for Risk-neutral pricing of derivatives Understand the concepts of Martingales and Markov processes Understand the basic properties of Random Walks, Brownian Motion, Stochastic Integral Develop continuous time models and value basic asset classes such as European options using Black and Scholes\n    Prerequisites: Background in Calculus and Probability",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus-FE630-Fall24.json",
    "course_code": "FE630",
    "course_title": "Portfolio Theory and Applications",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Portfolio Theory and Applications (FE630)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Prof Pape Ndiaye\n    Description: This course is an introduction to quantitative portfolio theory, practice, optimization, and management. It addresses investor choice, market opportunities, and optimal portfolio selection. It examines security covariance and return models, performance analysis, and return attribution. It provides also an introduction to some basic methods for robust portfolio construction. The course will also include a computational component in which students will construct optimal portfolios, track their behavior, and analyze their performance.\n    Learning Outcomes: Compute Absolute Risk Aversion (ARA), Certainty Equivalent of Risky (CER) of risky gamble and Risk-premiums Solve Optimal Decision Problems arising in Modern Portfolio Theory and implement the solution using a high level language such as R, Matlab or Python Design Markowitz efficient portfolios and use the One-fund Theorem and the Two-fund theorem to build efficient Portfolios with Target Return or Target Risk Use CAPM, APT and Factor Model to compute security Expected Returns and Risk and Covariance Apply Markowitz Allocation to design, implement and backtest Optimal Portfolios using historical price time series, analyze the sensitivity to various inputs, and manage Fixed Income portfolios\n    Prerequisites: Background in Algebra, Optimization, Stochastic Calculus Comfortable with the material presented in FE 543 or FE610 (Stochastic Calculus for Financial Engineering) and FE620 (Pricing and Hedging) Some familiarity with Matlab and R, (and / or Python)",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus.FA800.Fall2023.json",
    "course_code": "FA 800",
    "course_title": "Special Problems in Financial Analytics",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Special Problems in Financial Analytics (FA 800)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Ionut Florescu\n    Description: This course is designed for students undertaking a research or analytical project either individually or as a group.\n    Learning Outcomes: \n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus.FE540.fall2023.json",
    "course_code": "FE 540",
    "course_title": "Probability theory for Financial Engineering",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Probability theory for Financial Engineering (FE 540)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Ionut Florescu\n    Description: The main goal of this course is to provide FE and FA students with the necessary probability theory background to ensure a proper performance for the remaining classes in the programs.\n    Learning Outcomes: Perform probability reasoning and fundamental probability calculations. Understand stochastic processes. Proper introduction of random variables.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus.FE541.fall2024.json",
    "course_code": "FE 541",
    "course_title": "Applied Statistics with applications to Finance",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Applied Statistics with applications to Finance (FE 541)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Ionut Florescu\n    Description: The course prepares students to employ essential ideas and reasoning of applied statistics.\n    Learning Outcomes: Understand and summarize complex data sets through graphs and numerical measures Calculate estimates of parameters using fundamental statistical methods Give measures of how good the estimators are by providing confidence intervals or approximate confidence intervals Apply statistical tests to experimental observations Estimate and calibrate parameters of mathematical models using real data Study relationships between two or more random variables Lay the foundation for a more advanced applied statistical course such as time series analysis, statistical learning, deep learning, and more.\n    Prerequisites: A sound understanding of probability gathered through an undergraduate class such as MA222 or QF 212 or equivalent.",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus_ 2024S FA 636-A.json",
    "course_code": "FA 636-A",
    "course_title": "Advanced Risk Analytics",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Advanced Risk Analytics (FA 636-A)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Majeed Simaan, Ph.D., FRM\n    Description: Given the advancement of statistical tools, the course aims to leverage state-of-the-art analytics for financial risk management.\n    Learning Outcomes: Apply the learned topics on a regular basis using in-class labs and one major project Utilize state-of-the-art data science libraries for risk modeling Build on recent research ideas for risk assessment Leverage predictive models for market and credit risk management\n    Prerequisites: QF435 or FE535 or instructor's permission",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus_FA542_F24.json",
    "course_code": "FA-542",
    "course_title": "Time Series with Applications to Finance",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Time Series with Applications to Finance (FA-542)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Dragos Bozdog\n    Description: This course is designed for Master and Ph.D. graduate students and advanced undergraduates. The purpose is to learn applied statistical methodologies pertaining to time series.\n    Learning Outcomes: The ability to approach and analyze any discrete time signal from a time series perspective. The ability to differentiate between various time series models. The ability to forecast future observations of the time series.\n    Prerequisites: FE 540 or MA 540 FE 541 or MA 331 or MA 541 or MA 612",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus_FA582_F23.json",
    "course_code": "FA-582",
    "course_title": "Foundations of Financial Data Science",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Foundations of Financial Data Science (FA-582)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Dragos Bozdog\n    Description: This course will provide an overview of issues and trends in data quality, data storage, data scrubbing, and data flows.\n    Learning Outcomes: Have a working knowledge of the issues of data quality, data storage, data scrubbing, data flows, and their potential solutions. Understand and design various schemas needed for the representation of financial data. Tackle problems dealing with data management issues such as collection, warehousing, preprocessing and querying. Have a working understanding of all the databases available for them through the Hanlon lab. Understand the data science pipeline process including processing, analytical tools, and outlier analysis. Apply the newly acquired data management and database skills to analyze financial data from the capital markets, social media, and the financial services sector.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus_FE513_section_A_WS (2).json",
    "course_code": "FE 513 - A/WS",
    "course_title": "FE513",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: FE513 (FE 513 - A/WS)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Cheng Lu\n    Description: The course aims to introduce the required techniques and fundamental knowledge in data science techniques. It helps students to be familiar with database and data analysis tools. Students will be able to manage data in database and solve financial problems using R program packages.\n    Learning Outcomes: Use R to scrape, clean, and process data Use relational database to store data locally Manage database through R and get data from database using R Design efficient relational databases for different data sizes and different industry Use NoSQL (MongoDB) to store data Design efficient MongoDB databases\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus_FE680_A24.json",
    "course_code": "FE-680",
    "course_title": "Advanced Derivatives",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Advanced Derivatives (FE-680)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Dragos Bozdog\n    Description: This course will address the practical and theoretical issues for interest rate models, credit models, and hybrid instruments.\n    Learning Outcomes: understanding and implementation of advanced interest rate derivatives models. ability to model single name credit derivatives. ability to model multi-name credit derivatives.\n    Prerequisites: FE 620 – Pricing and Hedging",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus_FE800-2.json",
    "course_code": "FE 800",
    "course_title": "Project in Financial Engineering",
    "semester": "",
    "year": "",
    "text": "Course: Project in Financial Engineering (FE 800)\n    Semester:  \n    Credits: \n    Instructor: Khaldoun Khashanah\n    Description: This course is designed for FE students undertaking a research or a project in financial engineering either individually or as a group.\n    Learning Outcomes: Develop research skills Enhance communication skills Work on research-oriented projects in a group environment Train professional presentation and scientific writing skills\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus_FIN 648_YW_S24_Jan 25.json",
    "course_code": "FIN 648",
    "course_title": "International Finance",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: International Finance (FIN 648)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Dr. Ying Wu\n    Description: The course covers important topics in international financial management, including foreign exchange management.\n    Learning Outcomes: Describe the principle of comparative advantage and absolute advantage. Describe the international monetary system and a variety of exchange rate systems in the world. Describe relationships between exchange rates and economic variables. Identify best practices for measuring and managing exchange rate risk. Synthesize and evaluate financing options for multinational corporation management. Gain a practical understanding of factors contributing to foreign exchange rate risks.\n    Prerequisites: FIN 510 Financial Statement Analysis FIN 616 Managerial Economics FIN 638 Corporate Finance",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus_MA 541-WN (Fall 2024).json",
    "course_code": "MA 541",
    "course_title": "Statistical Methods",
    "semester": "FALL",
    "year": "2024",
    "text": "Course: Statistical Methods (MA 541)\n    Semester: FALL 2024\n    Credits: 3\n    Instructor: Hong Do\n    Description: This course offers an introduction to exploratory data analysis and the use of basic statistical tools.\n    Learning Outcomes: Apply basic and classical statistical concepts, theories, methodologies, inferences, and models that are important in data science and machine learning. Demonstrate the complete data analyzing process commonly employed in academia and industry. Apply the required statistical skills to each stage of the data analysis procedure, including mathematical transformation of the scientific statement, data collection, data description, data preprocessing, model selection, output interpretation, conclusions, and decision-making. Compare the similarities and differences among various statistical models, estimation, and prediction methods as well as commonly used and advanced approaches to data analysis. Choose the appropriate statistical tools to understand and explore different types of data arising from engineering and sciences. Evaluate assumptions and restrictions made on classical statistical methodologies, and understand the importance of developing new technologies in machine learning and data science.\n    Prerequisites: MA 540",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus_MGT 699.json",
    "course_code": "Mgt 699",
    "course_title": "Strategic Management",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Strategic Management (Mgt 699)\n    Semester: Summer 2024\n    Credits: \n    Instructor: David Stahl, Ph.D., MBA\n    Description: This course presents models and ideas that can be used to improve decision-making in strategic management.\n    Learning Outcomes: Acquire conceptual models and tools to dissect a firm. Diagnose problems and evaluate a firm’s long-term prospects. Propose changes in strategic direction. Identify viable initiatives that enhance a firm’s economic value. Refined ability to present evidence and conclusions.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "Syllabus_MGT610-WS_Fall_2024.json",
    "course_code": "MGT610-WZ",
    "course_title": "Strategic Perspectives on Project Management",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Strategic Perspectives on Project Management (MGT610-WZ)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Thomas Lechler, Ph.D.\n    Description: This course will introduce students to the Stevens’ concept of Project Value Management.\n    Learning Outcomes: Understand and apply innovative frameworks, concepts and tools to strategically managing projects in organizations. Assess the value of Project Value Management by understanding the limitations of classic approaches to project management. Use the project value paradigm to manage projects strategically at the levels of planning, execution, and control towards achieving value. Develop a project strategy to maximize the project’s value for key shareholders and stakeholders. Select the appropriate set of tools to manage projects strategically. Understand and differentiate between project risks and project uncertainties.\n    Prerequisites: MGT -609 EM -612 SYS -612 SDOE-612 PME -609 IPD -612 ME -636",
    "embedding_dim": 1536
  },
  {
    "filename": "syllabus_SYS 640_SP24.json",
    "course_code": "SYS640",
    "course_title": "System Supportability and Logistics",
    "semester": "",
    "year": "",
    "text": "Course: System Supportability and Logistics (SYS640)\n    Semester:  \n    Credits: \n    Instructor: \n    Description: This course introduces students to a disciplined approach to providing efficient and effective system logistics support, focusing on integrated supply chain and demand management.\n    Learning Outcomes: Integrate the knowledge acquired in this course. Integrate how the concepts and ideas in this course apply to actual business and/or government organizations. Apply the system supportability and logistics tools and techniques acquired in this course. Apply and improve the students’ ability to effectively work on teams.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 501 Syllabus.json",
    "course_code": "SYS 501",
    "course_title": "Probability and Statistics for Systems Engineering",
    "semester": "",
    "year": "",
    "text": "Course: Probability and Statistics for Systems Engineering (SYS 501)\n    Semester:  \n    Credits: 3.0\n    Instructor: Christian Sprague\n    Description: This course is designed for students with a background in engineering, technology, or science who have not taken a class in statistics or need a refresher class.\n    Learning Outcomes: Understand and apply probability distributions to a variety of data sets. Understand statistics associated with probability distributions. Understand concepts of confidence intervals. Apply hypothesis testing. Understand basic simulation steps.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 605 WS Course Syllabus.json",
    "course_code": "SYS605WS",
    "course_title": "Systems Integration",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Systems Integration (SYS605WS)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Walter Lucchesi\n    Description: This course provides an understanding of systems integration, approaches to architect, design, implement, verify, and validate integrated systems.\n    Learning Outcomes: Understand the relationship between system architecture and system integration. Understand the relationship between system requirements and verification testing. Understand the relationship between stakeholder needs and system validation. Develop plans for systematically integrating a complex system. Represent needs of integration, verification and validation needs early in the system lifecycle. Design effective verification and validation systems. Design verification tests to ensure that system specifications are met. Design validation tests to demonstrate that customer and stakeholder needs are fully met. Utilize a wide range of testing methods and tools.\n    Prerequisites: SYS625 SYS650",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 611 Syllabus - 20240107.json",
    "course_code": "SYS 611",
    "course_title": "Modeling and Simulation",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Modeling and Simulation (SYS 611)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Dr. Robert Edson\n    Description: This course emphasizes the development of modeling and simulation concepts and analysis skills necessary to design, program, implement, and use computers to solve complex systems/products analysis problems.\n    Learning Outcomes: Examine classic and modern (state-of-the-art) modeling and simulation methods and techniques. Analyze socio-technical challenges and problems to determine appropriate modeling techniques. Apply the methods, processes, and tools needed to perform effective and efficient modeling and simulation on complex projects/programs. Conduct analysis of real-world data and complex problems. Describe the role of modeling and simulation within the systems engineering and the system development lifecycle.\n    Prerequisites: Graduate Status or approved by advisor and instructor",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 611 Syllabus.json",
    "course_code": "SYS 611",
    "course_title": "Modeling and Simulation",
    "semester": "Spring",
    "year": "",
    "text": "Course: Modeling and Simulation (SYS 611)\n    Semester: Spring \n    Credits: \n    Instructor: Dr. Robert Edson\n    Description: This course emphasizes the development of modeling and simulation concepts and analysis skills necessary to design, program, implement, and use computers to solve complex systems/products analysis problems.\n    Learning Outcomes: Examine classic and modern (state-of-the-art) modeling and simulation methods and techniques. Analyze socio-technical challenges and problems to determine appropriate modeling techniques. Apply the methods, processes, and tools needed to perform effective and efficient modeling and simulation on complex projects/programs. Conduct analysis of real-world data and complex problems. Describe the role of modeling and simulation within the systems engineering and the system development lifecycle.\n    Prerequisites: Graduate Status or approved by advisor and instructor",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 611 Syllabus_Summer2024.json",
    "course_code": "SYS 611",
    "course_title": "Modeling and Simulation",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Modeling and Simulation (SYS 611)\n    Semester: Summer 2024\n    Credits: \n    Instructor: Dr. Robert Edson\n    Description: This course emphasizes the development of modeling and simulation concepts and analysis skills necessary to design, program, implement, and use computers to solve complex systems/product analysis problems.\n    Learning Outcomes: Examine classic and modern (state-of-the-art) modeling and simulation methods and techniques. Analyze socio-technical challenges and problems to determine appropriate modeling techniques. Apply the methods, processes, and tools needed to perform effective and efficient modeling and simulation on complex projects/programs. Conduct analysis of real-world data and complex problems. Describe the role of modeling and simulation within the systems engineering and the system development lifecycle.\n    Prerequisites: Graduate Status or approved by an advisor and instructor",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 632 Detailed Syllabus 2023.json",
    "course_code": "SYS 632",
    "course_title": "Designing Space Missions and Systems",
    "semester": "Fall",
    "year": "2023",
    "text": "Course: Designing Space Missions and Systems (SYS 632)\n    Semester: Fall 2023\n    Credits: \n    Instructor: Prof Pam Magee\n    Description: This course examines the real-world application of the entire space systems engineering discipline to robotic space mission design.\n    Learning Outcomes: Enhanced understanding of the big picture for space missions and systems Working, technical knowledge of how the elements of a space mission work, how the functions of a space system are implemented in practice, and the key trades that lead to a successful mission Practical experience with using data and systems engineering processes in the Space Technology Series to develop conceptual designs for space missions and systems An organized framework for future space learning—on your own, in academic courses, or other short courses\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 635 WS Spring detailed syllabus.json",
    "course_code": "SYS 635",
    "course_title": "Human Spaceflight Mission Analysis and Design",
    "semester": "Spring",
    "year": "2023",
    "text": "Course: Human Spaceflight Mission Analysis and Design (SYS 635)\n    Semester: Spring 2023\n    Credits: \n    Instructor: Prof. Pam Magee\n    Description: This course is designed to provide the conceptual framework for developing crewed space missions starting from a blank sheet of paper.\n    Learning Outcomes: Summarize human spaceflight mission design principles, limitations and processes and apply them to develop goals, objectives as well as top level requirements Describe the physiological and psychological limitations and challenges for humans to live and work and space Explain basic principles of orbital mechanics and how they apply to human missions. Apply these principles to calculate and analyze trajectory and orbit maneuver options for different mission concepts. Describe and apply space element architectures, design and sizing principles and processes for on-orbit, ascent and re-entry operations. Apply sizing principles to estimate mass and power for a given set of requirements. Characterize the scope, functions and physical architecture options for human spaceflight support systems such as Environmental Control and Life Support, Thermal Control, EVA Systems and others. Apply sizing principles to estimate mass and power for a given set of requirements. Discuss scope, functions and requirements for mission operations elements including Operations Planning; command, control and communications (C3); Logistics; and in-situ resource utilization (ISRU).\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 640Stevens_syllabus.json",
    "course_code": "SYS640",
    "course_title": "System Supportability and Logistics",
    "semester": "",
    "year": "2023-2024",
    "text": "Course: System Supportability and Logistics (SYS640)\n    Semester:  2023-2024\n    Credits: \n    Instructor: Jason Cook\n    Description: This course introduces students to a disciplined approach to providing efficient and effective system logistics support.\n    Learning Outcomes: Integrate the knowledge acquired in this course. Integrate how the concepts and ideas in this course apply to actual business and/or government organizations. Apply the system supportability and logistics tools and techniques acquired in this course. Apply and improve the students’ ability to effectively work on teams.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 645 Syllabus rev 2.json",
    "course_code": "645",
    "course_title": "",
    "semester": "",
    "year": "",
    "text": "Course:  (645)\n    Semester:  \n    Credits: \n    Instructor: Bill Robinson\n    Description: This course provides students with a disciplined approach for identifying opportunities to influence the design of a system from a reliability, maintainability, and supportability perspective.\n    Learning Outcomes: Understand and utilize the systems’ impact of reliability, maintainability and supportability.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 650 Course Stevens Format.json",
    "course_code": "SYS 650",
    "course_title": "Systems Architecture & Design",
    "semester": "Summer",
    "year": "2023/2024",
    "text": "Course: Systems Architecture & Design (SYS 650)\n    Semester: Summer 2023/2024\n    Credits: \n    Instructor: Dr. Don Schlomer\n    Description: System Architecture and Design describes the fundamentals of system architectures and the architecting process, including practical heuristics for developing good architectures.\n    Learning Outcomes: Understand the link between the functional and physical system architectures and the iterative nature of architecture development. Apply a process for flowing down or allocating system level requirements to components level requirements through equivalence, apportionment, synthesis and other methods. Apply the experience gained through the use of a systems engineering based tool that supports systems engineering requirements, architecture and modeling processes. Develop an architecture applying the methods learned in the course. Understand the strategic role of architecting, and the value of functional modeling.\n    Prerequisites: Fundamentals of Systems Engineering (SYS 625)",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 660 Syllabus for Online Courses_FALL 2024-1.json",
    "course_code": "SYS 660",
    "course_title": "Decision and Risk Analysis for Complex Systems",
    "semester": "Fall",
    "year": "2024",
    "text": "Course: Decision and Risk Analysis for Complex Systems (SYS 660)\n    Semester: Fall 2024\n    Credits: \n    Instructor: Earl Sprague\n    Description: The ability to structure and analyze an effective trade study under conditions of uncertainty and risk is a core systems engineering skill.\n    Learning Outcomes: Define a decision Explain the basics of probability theory important to decision making Recognize factors contributing to successful and unsuccessful decisions Apply a simple model for decision making Discern the difference between a well-framed problem and a poorly-framed one Utilize at least two techniques for generating alternatives Apply at least three techniques for deciding a course of action Define risk and opportunity Set up a risk/opportunity management plan Define the difference between risk and issues Structure and solve decision problems using an engineering trade study approach\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 660 Syllabus for Online Courses_SPRING 2024.json",
    "course_code": "SYS 660",
    "course_title": "Decision and Risk Analysis for Complex Systems",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Decision and Risk Analysis for Complex Systems (SYS 660)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Earl Sprague\n    Description: The ability to structure and analyze an effective trade study under conditions of uncertainty and risk is a core systems engineering skill.\n    Learning Outcomes: Define a decision Explain the basics of probability theory important to decision making Recognize factors contributing to successful and unsuccessful decisions Apply a simple model for decision making Discern the difference between a well-framed problem and a poorly-framed one Utilize at least two techniques for generating alternatives Apply at least three techniques for deciding a course of action Define risk and opportunity Set up a risk/opportunity management plan Define the difference between risk and issues Structure and solve decision problems using an engineering trade study approach\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 660 Syllabus.json",
    "course_code": "SYS 660",
    "course_title": "Decision and Risk Analysis",
    "semester": "",
    "year": "",
    "text": "Course: Decision and Risk Analysis (SYS 660)\n    Semester:  \n    Credits: 3\n    Instructor: Safa El Kefi\n    Description: The ability to structure and analyze an effective trade study under conditions of uncertainty and risk is a core systems engineering skill. This course addresses the foundations of decision analysis and probability theory that are relevant to systems engineers.\n    Learning Outcomes: Develop a fundamental objective hierarchy or value tree to solve a decision. Solve decision problems using decision trees, expected value, influence diagrams, Pugh Matrix, and engineering trade studies. Incorporate risk management into the decision-making process to prevent unintended negative consequences and to take advantage of opportunities. Formulate strategies to avoid negative consequences and potential impacts of human behavior on decision making. Discuss factors contributing to successful and unsuccessful decisions. Apply decision making process steps to maximize success.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS 670 SIT Syllabus Summer2024.json",
    "course_code": "SYS 670",
    "course_title": "Forecasting and Demand Modeling",
    "semester": "Summer",
    "year": "2024",
    "text": "Course: Forecasting and Demand Modeling (SYS 670)\n    Semester: Summer 2024\n    Credits: 3 credits\n    Instructor: Dr. Teresa Zigh\n    Description: This course builds analytical skills for developing mathematical models for decision-making concentrating specifically on time series data. It covers the theory and application of modeling demand and consumer behavior using statistical methods for analysis and forecasting for facilities, services, and products.\n    Learning Outcomes: Understand the conceptual underpinnings of methods in time-series forecasting Be familiar with forecasting precision validation measures and be able to use the measures as guidelines for model design and development Select appropriate models based on theoretical standards, and judge the suitability of models based on the assessment of performance and usability Use available software analysis tools with ease, and to select appropriate tools for various analyses and situations.\n    Prerequisites: Knowledge of probability and statistics",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS-645 Syllabus rev 2.json",
    "course_code": "645",
    "course_title": "",
    "semester": "",
    "year": "",
    "text": "Course:  (645)\n    Semester:  \n    Credits: \n    Instructor: Bill Robinson\n    Description: This course provides students with a disciplined approach for identifying opportunities to influence the design of a system from a reliability, maintainability, and supportability perspective.\n    Learning Outcomes: Understand and utilize the systems’ impact of reliability, maintainability and supportability.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS650 Syllabus Spring 2024 v2.json",
    "course_code": "SYS-650",
    "course_title": "System Architecture and Design",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: System Architecture and Design (SYS-650)\n    Semester: Spring 2024\n    Credits: \n    Instructor: Antonios Kotoulas\n    Description: System Architecture and Design describes the fundamentals of system architectures and the architecting process, including practical heuristics for developing good architectures.\n    Learning Outcomes: Understand the link between the functional and physical system architectures and the iterative nature of architecture development. Apply a process for flowing down or allocating system level requirements to components level requirements through equivalence, apportionment, synthesis and other methods. Apply the experience gained through the use of a systems engineering based tool that supports systems engineering requirements, architecture and modeling processes. Develop an architecture applying the methods learned in the course.\n    Prerequisites: SYS625 Fundamentals of Systems Engineering",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS670 Syllabus.json",
    "course_code": "SYS670",
    "course_title": "Forecasting and Demand Modeling",
    "semester": "",
    "year": "2022",
    "text": "Course: Forecasting and Demand Modeling (SYS670)\n    Semester:  2022\n    Credits: 3\n    Instructor: \n    Description: This course builds analytical skills for developing mathematical models for decision-making concentrating specifically on time series data.\n    Learning Outcomes: Develop appropriate forecasting time series models based on theoretical standards Judge the suitability of models based on the assessment of performance, fitness, and applicability Utilize appropriate software analysis tools for various analyses and situations Propose relevant recommendations with accuracy measurements to various levels of managerial staff\n    Prerequisites: Knowledge of probability and statistics",
    "embedding_dim": 1536
  },
  {
    "filename": "SYS_637_Online_Syllabus_Spring_2024.json",
    "course_code": "SYS 637",
    "course_title": "Space Missions Operations",
    "semester": "Spring",
    "year": "2024",
    "text": "Course: Space Missions Operations (SYS 637)\n    Semester: Spring 2024\n    Credits: \n    Instructor: \n    Description: This course explores the challenge of designing and implementing real-world mission operations in a practical, cost-effective way.\n    Learning Outcomes: Define and explain the critical activities of space mission operations Discuss the inputs, outputs and uses for a space Mission Operations Concept and be able to critically analyze one of these key documents Describe the elements that contribute to mission operations complexity and perform trade-off analyses to reduce that complexity Analyze mission orbits to determine ground system pass characteristics Describe key elements of mission ground systems Compare and contrast operations concepts for military, civil, scientific and human space missions Develop and analyze aspects of simulated satellite pass plans\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "v^ BIA 662-[GenAI]Syllabus-Revised01-2024 (1).json",
    "course_code": "BIA 662",
    "course_title": "Augmented Intelligence and Generative AI",
    "semester": "",
    "year": "",
    "text": "Course: Augmented Intelligence and Generative AI (BIA 662)\n    Semester:  \n    Credits: \n    Instructor: Dr. Chris Asakiewicz\n    Description: This course explores the area of augmented intelligence and its implications for today’s world of big data analytics and evidence-based decision making.\n    Learning Outcomes: Understand and discuss what augmented intelligence and generative AI is, and how it differs from traditional approaches. Plan and use the primary tools associated with augmented intelligence and generative AI. Plan and execute a project that leverages augmented intelligence and generative AI. Understand and discuss the business implications of augmented intelligence and generative AI.\n    Prerequisites:",
    "embedding_dim": 1536
  },
  {
    "filename": "v^ BIA 662-[GenAI]Syllabus-Revised01-2024.json",
    "course_code": "BIA 662",
    "course_title": "Augmented Intelligence and Generative AI",
    "semester": "",
    "year": "",
    "text": "Course: Augmented Intelligence and Generative AI (BIA 662)\n    Semester:  \n    Credits: \n    Instructor: Dr. Chris Asakiewicz\n    Description: This course explores the area of augmented intelligence and its implications for today’s world of big data analytics and evidence-based decision making.\n    Learning Outcomes: Understand and discuss what augmented intelligence and generative AI is, and how it differs from traditional approaches. Plan and use the primary tools associated with augmented intelligence and generative AI. Plan and execute a project that leverages augmented intelligence and generative AI. Understand and discuss the business implications of augmented intelligence and generative AI.\n    Prerequisites:",
    "embedding_dim": 1536
  }
]